[{"game": {"title": "Mount & Blade II: Bannerlord", "description": "The horns sound, the ravens gather. An empire is torn by civil war. Beyond its borders, new kingdoms rise. Gird on your sword, don your armour, summon your followers and ride forth to win glory on the battlefields of Calradia. Establish your hegemony and create a new world out of the ashes of the old.", "developer": "TaleWorlds Entertainment", "publisher": "TaleWorlds Entertainment", "rating": 9, "review_count": 139992, "release_date": "30 Mar, 2020", "features": ["Single-player", "Online PvP", "Partial Controller Support", "Steam Cloud", "Remote Play on Tablet"], "tags": ["Medieval", "Strategy", "Open World", "RPG", "War"], "img": "https://cdn.cloudflare.steamstatic.com/steam/apps/261550/header.jpg?t=1626026727", "min_sys_req": ["Requires a 64-bit processor and operating system", "OS: Windows 7 (64-bit only)", "Processor: Intel® Core™ i3-8100 / AMD Ryzen™ 3 1200", "Memory: 6 GB RAM", "Graphics: Intel® UHD Graphics 630 / NVIDIA® GeForce® GTX 660 2GB / AMD Radeon™ HD 7850 2GB", "Storage: 60 GB available space", "Additional Notes: Integrated GPUs require additional 2GB of system RAM. These estimates may change during final release."], "rec_sys_req": ["Requires a 64-bit processor and operating system", "OS: Windows 10 (64-bit only)", "Processor: Intel® Core™ i5-9600K / AMD Ryzen™ 5 3600X", "Memory: 8 GB RAM", "Graphics: NVIDIA® GeForce® GTX 1060 3GB / AMD Radeon™ RX 580", "Storage: 60 GB available space", "Additional Notes: These estimates may change during final release."]}, "reviews": [{"text": "A lord refused to nominate me for a castle after I successfully captured it so I switched sides, tracked down his wife, and chopped her head off. 10/10", "helpful": "2,051 people found this review helpful, 2,440 people found this review funny", "recommendation": "Recommended", "rewards": 20, "hrs_on_record": 247.3}, {"text": "One of the best War games I've played plus I used Voiceattack for voice commands. I felt like a field general lol wife thought I was nuts.", "helpful": "312 people found this review helpful, 267 people found this review funny", "recommendation": "Recommended", "rewards": 47, "hrs_on_record": 443.0}, {"text": "Has a long way to go. Needs more quest content, more depth, some fixes, added character interactions and dialogue and alot more.It's still fun, it's a modern warband after all. But it could be much more.", "helpful": "2,072 people found this review helpful, 24 people found this review funny", "recommendation": "Recommended", "rewards": 2, "hrs_on_record": 68.4}, {"text": "This is my first review on steam ever. I felt it was kind of my duty to give my opinion on the game that I have personally been waiting for over 6 years, as Warband happens to be -if not the- one of my all time favourite games (with around 1100 hours of gamplay - yes I know, still rookie numbers compared to some other of its fans, but still, that's a considerable amount of my life's time).So, I have -as of now- played 63 hours of Bannerlord and another 155 hours of the multiplayer beta of which I had the honor of being a part. I now feel confident enough to talk about why I think that you should get the game yourself, especially if you loved any of its previous titles.First of all, the game is aesthetically a HUGE development from the awkward indie 2010 (that -even then- still felt older) graphics, which we all grew to love. The animations seem more realistic, the items more detailed, the campaign map is incredible and the scenery (from the snowy forests of Sturgia to the desert wastelands of the Aserai homeland, and from the rocky Battanian villages to the great cities of the Empire) is beautiful and at times even -dare I say- majestic. Sure, the graphics still don't compare to the other big games of its time, and the character models still look a bit odd, but for a game of a small company like Taleworlds that chooses to focus more on the gameplay and the game's mechanics, you can at least overlook some of their flaws.I should also point out here that the game takes place around 200 years before the events of Warband, in a world where the Calradic Empire still exists, although in crisis, and new and old kingdoms arise in its wake. Some of the factions are the ones that evolved into the ones in Warband (Vlandia is the predecessor to the Swadians and the Rhodoks, Sturgia is a mix between the Vaegirs and the Nords, the Khuzaits are the khanate before the rise of the Khergits, and the Aserai the previous Sultanate to the Sarranids), while we also have the Battanians (a celtic-like mountain kingdom) and the Calradic Empire (an empire very similar to the medieval Greco-Roman -now known as Byzantine- Empire). Each of these factions is very well made in order to feel unique and different to the others, with its own architecture, clothing style and troops, that are very close to their historical inspirations, giving you a nice depiction of some fields of what the actual medieval world looked like (and in some cases how it worked).Now, for Single Player, on a first look you'd say \"That's an enhanced version of Warband\" and you'd may be right for the most part, but the game offers many new features and details that differentiate it from its predecessor. Examples of this are the many convenience options, like the way you can recruit troops from villages and towns which can be more and better if you have good relations with the village's notables or the fact that you can see the full items' stats and compare them to your own. There are many new features, like the Clan and its mechanics (basically you, your family and your companions), the fact that you can have children and continue to play as them once your older character finally kicks the bucket, the forging system which allows you to make weapons and choose how they will look on your own, the new Kingdom Mechanics, that enhance the experience of serving or ruling a realm with multiple armies and kingdom laws, and the fact that you can now kill nobles that you capture, with whatever consequences that may entail. Other features have been renewed, fixing annoying issues that existed in Warband or completely changing the way they worked for the better, like, for example, the new massive battles with more thought out AI-planning, and the sieges, that now have siege weapons and are not just a mass of angry people cramming a small ladder only to get violently killed by the other mass of angry people that awaits them on the walls.For Multiplayer, there are now 3 main modes, which are Skirmish 6v6 (which is like battle and conquest together), Captain 6v6 (which allows every player to command a small band of troops) and Siege (which is the good ol' siege we all know and love, polished with siege weapons and some new mechanics). There is also a Team Deathmatch mode which is more like a playground to prepare you for the real modes above. Now, the way the combat works is almost the same as in Warband (with some minor changes like a shield bash move, a crouch move and chain attacks) and I feel like it is what we should expect, even though I hear complaints about it being \"clunky\" and \"unreliable\". I personally enjoy it as I did in Warband and I'd say it is highly dependent on skill and experience (I believe it's hard to learn and to master, but once you do, it offers you a very fun and challenging experience). Of course, there are still many issues and bugs which make you question the fact that this is a game that was in development for 8 years and that it is priced as much as it is. If you buy it now, mind that you will come across a lot of them. That being said, you should also keep in mind that this is still Early Acccess and many of them are bound to change. Also, you have to AT LEAST give credit to the developers for keeping track with the complaints and the feedback of the players, having already made 10 updates (during the first 10-11 days since the release!) and continuing strong. Honestly, the way they keep hunting for issues and bugs and the way they listen to negative feedback is all I could ask from a game studio (which, again, is not a major one) and, if anything, deserves my support in this journey of making the game that we all have dreamt and still dream of.Overall (and sorry for this lengthy essay), the game is a worthy successor to Warband. It offers you a pretty similar experience that Warband did (letting you explore a vast world of different cultures and giving you the freedom to make your own story, whether it is of the journeys of a merchant, the adventures of a warlord, the path of terror left behind by a bandit leader, or the rise of a new ruler) which is exactly what we should all have expected and hoped for. And yet, even as a game that offers content and possibilities the size (and even significantly bigger than the size) of Warband, it still feels like it has not even scratched the surface of what it is capable of, leaving space to be filled in ways that we haven't even immagined by the many and various mods that are bound to follow (and have already started making their entrance) by the ever restless and creative modding community of Mount&Blade. So, if you have waited for this game like I have and still wonder if you should buy it in its current state I'd say, yes, join this journey, because even if it's not yet all you have dreamt of, given time and support it's going to be. If you are new to Mount&Blade, and think that it is a little overpriced for a game that is not fully completed yet, you can always wait until it comes out of EA, but I would personally recommend that you give it a go, and in the end you will be glad you did.", "helpful": "1,307 people found this review helpful, 25 people found this review funny", "recommendation": "Recommended", "rewards": 9, "hrs_on_record": 170.6}, {"text": "With 2,192 hours in Warband, I think it's safe to say that I've experienced my fair share of the classic Warband experience that Bannerlord is not only trying to emulate but also build upon. With 15 hours in the game, I'm already of the belief that Taleworlds will not only achieve this end, but surpass it.The game is buggy, yes. Some of the bugs are obnoxious, yes. There are portions of content missing that are sorely needed. Not only is this true, but the disappointment surrounding it is understandable. After 8 years of waiting, 10 for some, this series has cultivated a cult following of dedicated and loving fans, myself very much included, who want nothing more than to dive head first into the game.But it's very much an early access and anyone who finds themselves overly disappointed by the state of the game needs to remind themselves that it is still in its infancy. Even now, the content included in the game is entertaining; compared to Warband, combat actually feels weighty, and adventuring around Calradia has a heightened sense of danger and excitement to it. Side activities such as smithing allow for those interested in roleplay to create deeper stories for their characters, and core mechanics such as trading have been developed and enhanced in this new release to feel far more responsive and rewarding.It is clear from the two very quick patches it has already seen that this early access is one that Taleworlds are committed to building upon. Bugs will be worked out, content will be added, and I am firmly of the faith that the game will continue to evolve and take shape over the coming days, weeks and months. Everyone is well within their rights to leave a negative review, but I would encourage people not to damage the game's rating unfairly, as the current release is not indicative of the finished product.The thing that Bannerlord needs right now is committed players to continue to highlight issues so that they can be resolved. The framework provided to us now sets a good vision for the final product, and I can't wait to see that vision be fulfilled.", "helpful": "1,817 people found this review helpful, 36 people found this review funny", "recommendation": "Recommended", "rewards": 3, "hrs_on_record": 130.6}, {"text": "Had my entire fortune poached by wandering looteres, most of my men were killed, those who weren't died later of starvation and the only one to make it to a town was me. Where I was promptly ambushed by brigands, who *let me go* because I was *too* poor. At some point I realized I'd lived my entire life in poverty, misery and eventually I decided to turn my life around.I became a blacksmith, created some minor works - barely making a profit. Until one day, when I made a sword that broke the town's economy. Everyone wanted my sword. In merely a day, I'd earned enough to purchase largess too grand for even kings. Then my life - so deprived in years gone by - was filled but still empty. Money begets money, and violence begets violence. Eventually, when I had conquered the world I knew nothing but stillness. My clan was large and thus was my lot.  Eventually life was bleak, if a man could have anything, would he want for nothing? Or did it mean he could not desire anything, as well? Then, it was 3 am and I realized I had work in the morning.All in all, ten out of ten, would Bannerlord again.", "helpful": "555 people found this review helpful, 365 people found this review funny", "recommendation": "Recommended", "rewards": 194, "hrs_on_record": 117.3}, {"text": "Great game... who need 1 or 2 years of development. tl;dr: mid game turn into a micromanagment hell.The game is fantastic until a certain point. You start as a mercenary, one party, 50-150 soldiers doing missions, small battles or bigger fights joining armies. Good graphics, brutal engagments with 200-1000 units at the same time if your computer can handle, playing as a soldier is a blast.The problems start when you get a few towns and a bigger family, the micromanagement never stops and gets worse overtime. You have to physically move your party to towns to fix their issues. When your lords get captured & escapes, they'll go into a random town until you pick em again, then you'll have to reform the party. Same with caravanes for trading, if they get captured, you'll have to go in his town and recreate the caravan. You have to partially fill towns with soldiers, manually, from your own soldiers. All the little fun things of the beginning soon become a hassle, as you can't delegate. Messengers are not a thing.You can't manage a town at a distance, you can't tell a party member to move to a location or guard a territory, they do whatever they want if they're out of your army / party, so you have to do it yourself. Either you're leading your huge army to fight what is basically an enless war mid game, or you take care of your cities while the rest of your faction fight... with various success. Some commanders are pretty good, other will throw waves of recruits at highly trained arbalists in the open backed with cavalry. Protip: don't be a recruit in an imperial army.You can't tell a party you created to guard an area or to kill all bandits attacking your villagers, it's up to you, or the IA if it feel like it. Worst, if you let the parties you created roam around (parties = group of 70-200 soldiers under a lord) they can be (temporarily) drafted in other armies of your kingdom... and you'll have to physically move to the army, talk to the leader and pay some reputation to get them back. Of course, large armies are slow. This leads the the next problem, swarms.My worst fear is not a massive army, it's an army disbanded in the middle of my territory. The small parties usually start raiding all villages in the vicinity while being too fast to be catched by a big army. Raided villages impact your town / castle loyalty and gold quite heavily. Sure, you could disband your army and hunt them yourself... but that makes you take a step back, and all your parties would reform under another army you can't control. And man, some army commanders are really, really stupid. Verdun style charge in the open against walls of archers, cavalry in a forest vs pikemens, you name it. I can't count the time i had parties wiped in someone else army. But let's say you managed to capture the lords burning your villages.The capture system is broken. Captured lords escape A LOT. I had some escape 20 seconds after being captured. They never stay in a jail for more than a few in game days. Once they escape, they magically teleport to their hometown, rebuild a fast 80 mens army in the blink of an eye and go back to raiding villages. AI \"cheat\" with recruits, they will always find soldiers in town, even if they're empty for you. Executions you say?If you execute a lord, no matter how much of an A-hole he/she is, the whole faction will hate you. He raided dozens of villages and killed hundreds of peasants? Still not good enough. You just can't kill a lord without suffering heavy consequences down the line, and you'll need those lords to be friendly later. Worth to mention, capturing the leader of a faction won't stop a war.Last - peace / war is on/off. I had 600 days of continuous war, followed by 600 days of complete peace in the entire map (due to a bug apparently), and i'm now back at 300 days of war. Not a single day of peace, when one war stop another start immediatly. They will just never, ever stop fighting. Can't catch a breath, can't leave the front of your lose towns.Oh and the main quest randomly failed after 875 days or so.I would still recommand the game, it's really fun for a while but it need a HUGE QoL update.", "helpful": "401 people found this review helpful, 10 people found this review funny", "recommendation": "Recommended", "rewards": 42, "hrs_on_record": 113.3}, {"text": "Short version: If there was a tentative recommendation button, I'd be using it. It very much depends on the person, because while most people praise the game, there is a serious contingent that have reasons not to. The company has a history of promising big things and then using a second game to finish fulfilling them. If that turns you off, I don't blame you. It doesn't bother me as long as the first game is good in its own right, but I can agree that we shouldn't have to buy a second game to get what was promised. It's a good core for a game, but there are plenty of bugs I've seen. I tried walking the streets of Baltikhand and had a CTD while loading them in. I repeated the process to verify that the crash was a consistent thing. So stay off the streets of that town and just hit the trade and recruitment screens there. I'm having issues with attribute points not being given to me at every third level like they're supposed to be. I'm sure it'll get fixed but as of this review I haven't seen it happen. Also having a hard time leveling up charm skill despite following the instructions given in the tooltip. Not sure if it's a true bug, or if the tooltip isn't telling the whole story. I'll have to wait and see. All that being said, I adore what this game is doing with the series. We have families now. Not just a marriage for an alliance, but an actual clan, with potential for children, and a brother built right into the story. We're the head of a clan, not just a nobody adventurer making it on their own. It's very Crusader Kings II to me, and I'm loving everything I get into. There's even a politics system where we can spend influence to vote on land assignment, and we can spend that influence to put laws up to vote that have actual impacts on the stability and power balances within our Kingdoms. Being a vassal doesn't just have to mean warring, we can use our built in influence to do politics as well. Overall, I love it. If you're on the fence and don't want to spend 40 or 50 dollars on it yet, wishlist it, watch the patch notes, and see how it looks when it goes on sale for real. For the rest of you, I understand the hate and don't blame you. I just don't share it, and I recommend anyone with an interest at least keep an eye on it.Update: 400 hours in and almost a year after release, they've done a lot of bugfixing. They've also done a bit of fleshing out and adding in features. I can definitely say I've already gotten my money's worth from it, and I've been YouTubing it as well. It still suffers some problems from the old games so far. The combat gets samey and isn't all that balanced. There seems to be a big tendency toward telling things rather than showing them proper, and this isn't helped by gameplay and story segregation. Though I could honestly see the gameplay and story segregation being intentional. There IS a main quest chain with a story to it, and there's room to interpret that quest as pretty much poking holes in a lot of the flavor text. Again, not sure if intentional and if it is it's not really that smart a move on their part, but it's there if you want to read into it.I'm still giving the game my tentative yes. If you like the series and just want more Warband, this is definitely for you. If not, keep watching or look into other games.", "helpful": "1,243 people found this review helpful, 31 people found this review funny", "recommendation": "Recommended", "rewards": 2, "hrs_on_record": 491.2}, {"text": "Great game. Started playing during the second lockdown. Finished the game to the point of having my own empire, reaching the ability to fight multiple wars with over 380 troops in my personal army. Ambushed by groups of 800-100 and held small passages with 150 fian champions, a shield wall and just enough cavalry to route the enemy. Had every companion in my personal bodyguard unit and was run down by a flanking cavalary charge, most of my unit was dismounted, we had to fight our way back to our line. Ordered our shieldwall to take tremendous losses to get us back into the fighting. Creating a tusudo (square formation) around the companions and bodyguard unit while we fought against the 2 v 1 odds (realistic difficulty). Lost 90% of my army, most of my companions but we won that battle. When we get out, we siege the enemy castle with just enough soldiers to push the ram. We knock down the reinforced doors and engage in a skirmish. The companions start to fall, members who were with me from the beginning. My troops are outnumbered, holding a small room near the gate. The balance of power is slowly creeping in the right direction. We are down to the last 20 enemies. We have 9 of us left, holding the doorway the best that we can. I take a javelin to the head, instant K.O. My units keep fighting, my bodyguard with insane leadership and tactics, reforms the wall and finds 30 or so troops that I mismanaged to come around and flank. I watch the battle incapacitated, the units left on our side is under 10. The units left on there side is under 10. We get to 3 each, companions vs. enemy leaders. My wife is one of the companions, my brother Nogrand is the other. The last companion is a surgeon who somehow made it this far. He dies but not before he throws a perfect javelin and takes one of the enemy commanders. Nogrand and my wife are melee specialists, almost maxed fighting stats with pillaged level 6 weapons. They hold, they wound both the last commanders. We take the castle, executing the commanders. But this isn't over. We, 265 wounded, an effective fighting force of 2 with my character health at 1% are about to come under siege from a nearby army. The nearby army sets the castle under siege. Hours turn to days, the army of 600 is ready to fight and in the distance I see our last hope. I see the first lord I recruited in my battle against the empire. The lord I spent years chasing as a mercenary, relentlessly beating in battle to gain charm points... he with an army of 400 is charging this way in what looks like a rally to protect is king, his commander, his lord! He stops and watches my no save, death on, realistic campaign's final moments. He sits there, watching this enemy army take down our walls with trebs and in the last second... just as they start to storm the gates, my number 2, my favourite lord... just sits there. We lose the campaign, we fight to the end and with a valiant last stand my party is killed in battle. It is over, my sons killed, my wife murdered and staring at my 300 hours campaign, satisfied that the next time; i'm going to behead that lord and his entire family the first time we meet. Until next time... 10/10", "helpful": "578 people found this review helpful, 133 people found this review funny", "recommendation": "Recommended", "rewards": 158, "hrs_on_record": 648.9}, {"text": "Wait 10 more years for Final Release to truly enjoy this Grand Game!The reason to buy, for me, was not so much to play it now, but to learn to mod it, and enjoy it later with some fine Full Conversion Mods. It's an investment in the future really.The gameplay is a mixed bag atm.The main game loop feels pretty polished and satisfying.Combat is great, challenging, a bit better than in Warband.Smithing is an amazing crafting minigame and one of the best new features of BL. You smelt, refine, discover new parts, and explore new unique weapon combinations as you make your own gorgeous weapons. Make some of the best, most beautiful weapons yourself, and use them to chop chop smash smash! Thanks for that BL!The UI.. now allows for easy micromanagement. Significant quality of life improvements here.The whole game is vanilla, rough, unbalanced.Some mechanics don't work yet, or work poorly. Like don't try to get your brother married, it won't work. Don't get married, don't save your brother. You can, but you might not be able to access their inventories.Main quest can be impossible to complete.. you can only complete as vassal, the game doesn't know you are an independent faction when you are in fact.. an independent faction.Troop trees are rough and basic and copy-paste vanilla values, uninteresting to explore.Characters can be missing, impossible to find, stuck in some castle while in fact are not in that castle. The game points to Location A when in fact you can find them in Location B, somewhere probably.. near Location A. Or not.Characters can sometimes be teleporting around like Nonsense.Smithing, which I like a lot.. is beyond OP and completely crazy broken. Mild spoilers.. at least for now, until they fix their sht.. While Workshops are very hard to figure out, make very little, and most will not make any money at all. As in: zero.Kingdom features are broken or questionable. Like Clans, which are now your vassals, they are a mess. Instead of getting auto-offers from AI, Clans are hard to get, easy to lose and unfairly destroy relations. This makes Kingdom almost impossible.Peace offers from the AI will not happen. But you can buy peace with money, and since money is not an issue atm, it's just silly.Parties are poorly maintained AI armies that you pay for, they do not auto-recruit, but will get themselves captured and will waste valuable troops.Sieges have various issues. Like 1 guy unreachable forever will make you fail the siege. Troops management is a mess. Broken walls could be more like messy bottlenecks, but sometimes are simply turning a siege into a field battle, aka.. not much sieging gameplay if you simply break walls. Opening gates from the inside is tough, but when it works, it's silly and OP. I also had a few crashes after sieges.Most castles are not yet in game, there are just a few, and a ton of copy-paste, so not much interest in sieging the same castle again and again.XP seems pretty broken, it's extremely easy to get to around lvl 13-15ish, and then.. pfff. XP requirements for companions are simply broken. They will not lvl up, not this century at least. You finish the game and they are still 1-2 lvls away from where they started.Executions are.. a questionable feature, that simply splits the game in: either you do it, play a quicker, much simpler and more repetitive game, make a ton of enemies, potentially ruin your character, ruin diplomacy, be forced to go down the genocide path.. and bypass any reason to siege or make a Kingdom. Or not do it, play the long game of building good relations with the nobility, but miss all the murdering fun, secretly wish you could do it, and cry yourself to sleep every night. And end up in a mess with your Kingdom anyway. The problem here is.. you can easily lamify the game by executing all nobles. And instead of a juicy, rewarding, emotionally messy and mechanically complex end game, you just chop chop chop chop chop... THE END.The UI again! Needs more clarity, focus, better framing, better organisation, less clutter, more consistency and polish. Upgrades are hard to figure out at first, a bit odd, and the grey shield icons over the Skills that can upgrade are simply not visible enough, they should be Colorful Bright Glowy Animated [with a color that stands out]! Personally I prefer the grid structure of the Warband inventory.The frequent, entirely useless, and poorly designed autosave.. doesn't async save in the background. It freezes the game for a few seconds. You can't turn it off.And for now.. some crashes may happen, depending on how you play and what you may try.Last but not least.. press N to access the Encyclopedia! There should be a large button for it in the main UI/world view, it's essential!Cheers!", "helpful": "638 people found this review helpful, 22 people found this review funny", "recommendation": "Recommended", "rewards": 101, "hrs_on_record": 97.8}, {"text": "Wish it had a Co-op campaign so you could create a faction/kingdom with a bud. Great game!", "helpful": "948 people found this review helpful, 17 people found this review funny", "recommendation": "Recommended", "rewards": 227, "hrs_on_record": 362.5}, {"text": "Wish This had Co-op", "helpful": "1,172 people found this review helpful, 27 people found this review funny", "recommendation": "Recommended", "rewards": 78, "hrs_on_record": 188.7}, {"text": "Update 1: 6/4/20 - Devs have been aggressively patching the game since release. This is more than great news. If they keep up the good work we'll probably have a fully-featured working game much sooner than anticipated:).Ok let's be real:This is a 2014 early access game that was released in 2020. I love it, it's buggy, it's mount and blade, it's love. BUΤ:1)Game is buggy, so buggy that you should not only save often, but also in multiple saves cause there are many, many game-breaking bugs that force the player to start over if there's no other way to avoid loopholes.2)Game is not only unfinished, but also feels not properly tested too. Several bugs and missing textures are noticable right from the start while the game is still on rails before moving onto the sandbox gameplay. You just can't miss those things with even bare play testing. To prove my point, i wanted to visit a castle to see how it looks like so i visited Sestadeim. Guess what; Sestadeim castle exterior was EXACTLY the Lycaron City. This is just alpha material.Music is heaven. I believe it's more or less 50% of the games atmosphere.Graphics are gorgeous for a mount and blade game, ok for a 2020 release. Lighting kinda feels weird and fake, but that's just personal opinion. Generaly i'm very pleased.My advice:While it's playable, it's still very far from a steady release. If you're ok with that and you think you have the stamina to re-play the game several times untill it's ready and then some, then get it cause it's freakin awesome. It's mount and blade 2.0. But if you think you'll exhaust all your interest and you'll soon burn out before the game comes into glory, then you maybe should wait for a while and see what happens. I hope as review score now will slowly start to lower after the hype train's gone, taleworlds will continue/start improve their game for the sake of everything.Back into the game:)", "helpful": "1,130 people found this review helpful, 35 people found this review funny", "recommendation": "Recommended", "rewards": 0, "hrs_on_record": 14.1}, {"text": "The game is still technically in early access, so there are a few things missing like end-game Kingdom functionality and some dialogue options for companions, but overall it's entirely playable in its current state.Coming from Warband, this game is a true successor that improves upon the previous game in several ways. Those who are fans of the previous game will find much that is familiar to them here. Proxies for different Western powers in the land of Calradia, each with their own cultures, strengths, and weaknesses, and the ability to aid or hinder them. There are some quality of life improvements as well, such as the ability to speed up map time by 2x and food not rotting. Towns and castles too feel much more fleshed out, though like in the previous games there is no real need to walk around them and you can avoid doing so the whole game given you never buy a workshop.On top of that, there are some amazing additions, most notably smithing which allows you to custom create weapons how you see fit, and some others like siege weapons. Some aspects of previous games become much more commonplace here, namely tournaments and trade. Now tournaments provide unique items in addition to the gold you bet, and trade is much easier to get involved in and serves an important part of the beginning to mid-game. All in all, much of the game has been smoothed over and polished, retaining much of the older Warband feel while still being an improvement in most areas.Last but not least, the combat. For all the improvements to the base game mentioned above, combat remains one of, if not the largest draw to the series. I have to say, they did a damn fine job at it too. The combat here is so SATISFYING. Warband was fun, and it functions much the same here, but like everything else it has been improved upon. Hits feel a lot meatier as you ride by and cleave someone in twain with a polearm from horseback, duels feel much more tense as weapon handling has been refined, and troop controls have been improved with the ability to select different formations as well as delegate troop command to the AI (sergeants). The battlefields look gorgeous, although with noticeably repeating layouts, and the large scale battles are breathtaking.A pattern is repeated here, where troop commands were present in previous games but not quite as fleshed out or as central as they are here. The only thing I miss is the ability to tell troops to advance or retreat 10 paces, as well as the fact that the AI seems to have much more fine control of the troops than I can possibly manage.All in all, the game is great so far. As a Warband junkie, it feels like much the same game, only *better in almost every way*. The economy feels more involved, game mechanics more polished, and the combat more exhilarating. I can't wait for mods.", "helpful": "269 people found this review helpful, 10 people found this review funny", "recommendation": "Recommended", "rewards": 3, "hrs_on_record": 128.4}, {"text": "", "helpful": "6,772 people found this review helpful, 3,799 people found this review funny", "recommendation": "Recommended", "rewards": 17, "hrs_on_record": 7.0}, {"text": "I feel like a lot of people here forget what Warband was like or how different Warband was compared to the original Mount & Blade. Warband offered some added functionality, multiplayer, and something of a narrative but was effectively the same game as the original. Even with the Diplomacy mod, the marshal AI was atrocious, marshalling fickle AI lords was even worse, and the limited amount of quests were far more than frustrating. You can't pay me enough to herd zig-zagging cattle to armies, to deliver inconsequential messages across the map, or to fight up and down 80 degree inclines ever again. Even in early-access, Bannerlord is arguably the best medieval simulator on the market, making it more than worth its value at its current price point. The influence system alone is a godsend. No more dedicated marshals and no more soliciting every peer in the realm for votes. Influence controls votes, policies, marshalling, and maintaining army cohesion. I love it. The tactical game is unreal. Gone are the days of Swadian knight charges; the game is now about holding the high ground, giving your archers a line of sight, using your cavalry to harry and flank, and maintaining infantry line discipline, especially in battles with 800+ men. The maps make combat even better. Bridges, cresting hills, narrow valleys, river crossings, rolling sand dunes, and more. Each of these terrain types demand different tactics. Fighting is a lot more fun than in Warband. Two-handed weapons are an art. The animations are satisfying to watch as well. Spear a guy from the front and he flies backwards. Shoot an arrow into a guy's neck and he grasps at it before falling to his knees, dead. Ring a guy with your glaive and he spins around in the direction you struck him. Fantastic. I don't know what all this talk about wasted hours is about. Crashes maybe? I haven't suffered a crash for about 20 hours now. It last happened when I succeeded on the first of two persuasion attempts to marry the Khergit heir. The crash occurred because I opened the dialogue box through the army panel. No big deal. I disbanded the army after I finished a siege, approached the Khergit heir afterwards, and proceeded as planned. We have a kid now and his name is Junjad, but I affectionately refer to him as Junchad. I've only encountered one or two bugs that I couldn't work around, which makes this early-access release more than playable in my eyes.  The only thing I truly dislike about Bannerlord is the defensive siege game. It needs a lot more work. Offensive sieges can be fun though, but they too need some work (e.g. laddered siege towers are useless). I suggest cracking walls with four trebuchets (after racking them up in reserve) for the best experience.Lastly, I find the emergent gameplay qualities to be superb. I've rolled two characters: first with the Battanians and now with the Khuzaits. I've adopted my own roleplay rules (over recruitment, executions, and lofty ambitions) each time and the game enables that. I once got shot off my horse and was about to be swarmed, only to command my cavalry to sweep in and save my life as if I were Jon Snow. Too much fun. I've noticed some women die from childbirth, making lords bachelors again. Feels like a real, breathing world. It'd be nice though if lords and ladies killed each other every once in a while, seeing as they breed like rabbits, but I'm sure that's to come. I've waited a long time for this game and I am beyond happy with it so far. It reminds of me of CK2 back when it was first released — a great game with the potential to become a masterpiece. Thankfully, TaleWords doesn't make any other games. This is it. With 100+ employees, the potential is there. I wouldn't hesitate to buy as a former Warband player. As a newcomer with different expectations, maybe it's worth waiting for the full release. Up to you if you want to have fun now or later.", "helpful": "437 people found this review helpful, 7 people found this review funny", "recommendation": "Recommended", "rewards": 110, "hrs_on_record": 204.9}, {"text": "so after my first 144 hours in game, I have decided that the early access has a really strong foundation.The graphics are nice, combat is excellent (including horse movement and weapon use), the battles are excellent (including formations and orders), Sieges are much more improved from warband, with the addition of optional siege equipment. The towns feels alive, the factions are interesting and feel different culturally.I like the leveling up system, it feels pretty free, and not too complicated, with some nice benefits to putting time in to skills you are using in a way you enjoy the game anyway. Trading is fun, and a good way to make some cash, though the economy needs work as a whole (talked about below).I prefer the \"Sandbox Mode\" over the \"campaign mode\", as it just plonks you in the world alone, without a main story (much like Warband), though the story is fun the first time (desptire the tediousness of constantly getting repetitive quests)Your family tree, is also amazing. Getting a spouse, having children, watching them grow up, start families for themselves, eventually dying of old age and having your child take over is very immersive.Smithing needs a rework, as its really over/underpowered depending on what you are currently making. Though its necessary due to the below.While I like the Clan system over all, it needs some work mechanically, for instance, allowing lords to join you, despite their clan's intentions. This could work either as the Lord forming a new clan, or they are put in a \"rogue lord\" category until they are back in the same faction as the leader of their clan.. You can't make enough money naturally to achieve any of the necessary goals. Smithing cheese pretty much has to be used to balance the lack of money required for basic mechanics. This ties in to below. The way you end a war is just throwing a random lord $150k gold to stop it. No negotiations or agreements between the leaders of each faction (which is a step back for warband), OR your council can just agree to pay a daily tribute to stop the fighting (again, without agreement from the enemy you are paying tribute too). Also lords can just get auto ransomed, or escape very easily without your say or ability to stop it. This means that during a siege for example, you can defeat a lord, capture them, then have them come back with a new army during the same siege. That is a mess. You should be able to lock people up forever if you so want (or at least only have it so another lord breaks them out, or a tiny chance to escape, based on the security of the settlement).In its current state, the early game is incredible, the mid-game is fun, but the late-game only is really fun if you are a vassal. Having your own kingdom just isn't fleshed out yet.I think the game could be pretty easily perfected by removing the economy aspect from the diplomacy aspect. Not having to bottleneck the game with silver, and instead having diplomacy work on merit and situation alone would improve the game tremendously.edit: spelling mistake", "helpful": "254 people found this review helpful, 5 people found this review funny", "recommendation": "Recommended", "rewards": 24, "hrs_on_record": 311.3}, {"text": "Warband cranked to 11. Not without it's problems, crashes, and broken balance as an early access game, but even with Bannerlord mod-bombed I experience significantly less crashes and issues as of 1.2.0 personally.  TaleWorlds even borrowed some of the most popular mods made for Warband and incorporated them straight into vanilla Bannerlord. Infantry bouncing off shield walls, archers blotting out the sun with volleys of arrows, cavalry charging with spears couched headlong into the breach, and trebuchets reducing castle walls to rubble, all of which in real time with hundreds of units on screen at one time; every unit is a single entity that responds to, reacts to, and fights another unit (or you). Lines will break from morale depletion, attrition will occur if your (or other lords') morale is not managed. Stratagems from any of your favorite sword-and-shield RTS's will translate seamlessly to the battlefield in Bannerlord; it is quite simply an RTS with your own boots on the ground (if you wish, there is also auto-resolve).Player combat is not only refreshing, but frankly fun as hell. Every aspect of combat has been improved upon from Warband, from graphic fidelity to combat mechanics to animations. Although not hyper-realistic, sword-fighting and weaponplay is addictive; you will find yourself chasing looters for days just to s***stomp them for the fun of fighting and the plunder. The UI is being worked on, but there are glaring improvements in all aspects of menu navigation from Warband. Cities, castles and fiefs now have a stylized and more aesthetically pleasing menu card, and notables have portraits at the top of the menu which allow you to teleport straight to them to eliminate manhunting important people to talk to. Troop recruitment is also much more visual and allows you to select specific units, how many units you are buying, displays your current party size, and lets you know when you are over your limit.Fully dynamic world economy with shifting supply and demand that responds directly to not only your trade, but the AI's as well; becoming a medieval capitalist has never been more engaging and rewarding. Flooding a city or region with a certain good will affect it's demand, supply lines can be cut if peasants are intercepted while dropping goods off in cities, caravans can be plundered en route to their destination (yes, even your own), and sieges can block cities from receiving goods; all of which potentially affecting your workshop, caravan and city revenue. Keeping the scope of the world economy in mind, the game world itself is absolutely f***ing massive. There is a ridiculous amount of cities, fiefs, and castles to visit, plunder, or do trade with, all of which operated under the guiding hand of their respective owners. Kingdoms span for miles upon miles, maintaining their borders while wrestling for control with each other; there are PLENTY of kingdoms, all of which moving gold and waging war dynamically with each other constantly. And within these kingdoms, smaller bands of warriors reside; small, fiefless clans wander their territories and can be fought or brought into your eventual kingdom. Even still, bandits and looters scurry from treeline to treeline and along the foothills of mountains to stash their plunder at their (raidable) hideouts. Peasants and caravans make haste for their destinations to keep the gears of the economy grinding. The game world feels alive and organic at all times, a mark plenty of games miss. Maintaining relationships within the realms is important, because as is clear from the above you will be the smallest fish in the pond for a good length of time. There is a much heavier emphasis on relationships now, much more than Warband. Some people won't even talk to you, or will not allow you to accept quests if you are not on good terms with them. The amount of troops you can recruit from notables is also affected by relationships, and they will even deny you troops if you are not on good standings. Fief and city management is much more hands on, as there is plenty to build and improve within them. The management is accompanied by UI elements that help you visualize what you are building and will allow you to mouse over them to reveal what exactly each building does. Siege oriented buildings add depth to castle and city defense, allowing you higher garrisons, more militia, and increased siege build speed. Solid usage-based skill system (think Skyrim) that builds organically through gameplay relevant to applicable skills (ride your horse to level up your riding skill, etc.); no \"dumping points into skills after reaching another level just so you can (eventually) play how you want\" type of progression. You are not Dovahkiin, or some imperative prophet to the balance of the universe. You start exactly as any lowly sword-for-hire would in the Medieval period; with a few weapons relevant to your character's starting skills, horse, the clothes on your back, a small coin purse and no clout whatsoever. People will only know your name once you begin making ripples within the realms of the world or once you begin collecting battle scars; lords will politely state they have no idea who the f*** you are if they have never heard of you.Although official tools unfortunately have not been released to the public just yet, the extensive modding support stitched into the game offers far more than Warband could; TaleWorlds really listened, as the game was built from the ground up to be modded to High Hell. Planned mods in development range from GOT mods to LOTR mods (Warhammer 40k/Fantasy mods please and thank you?). A lot of the true potential for this game lies in the modding support and community; the game is already great out of the box. Everything in the game is value based, which insures you are on the same playing field as other lords within the game, for the most part. For instance with modding, you cannot mod one aspect of the game simply for your own benefit; if you raise the general income of cities with tweaks, AI will reap the benefits just as you will.This game is early access, and many of the systems within the game are planned to be even more fleshed out. More systems are planned to be added into vanilla entirely. There truly is no comparison within the medieval sandbox genre; the size, scale, fun-factor, and sheer addictiveness of this game dwarfs any other title within the genre. This game is one of the few true sandbox experiences on the Steam store and should not be overlooked merely because of the Early Access label.", "helpful": "454 people found this review helpful, 16 people found this review funny", "recommendation": "Recommended", "rewards": 1, "hrs_on_record": 165.4}, {"text": "+Already playable despite Early Access+Fun combat+Decent Graphics+Good foundation in place-Missing some key features from prev games-Not quite polished yetOpen-ended gameplay is where Mount & Blade II: Bannerlord, or any Mount & Blade really, shines the most. You start off with customizing your main character, choosing his background or origins from a multitude of different ways. Did he come from a poor, middle class or noble family? Was he a known troublemaker, good samaritan or just a smart scholar? There are tons of options of customizing your character background, and he also gets his starting skills from these.Aside from the starting quest to get you up and running, the game just tosses you out on the open. What to do next depending on your own, no main quest lines. Be a merchant, trader, mercenary, bandit, lord, soldier, even founding your own kingdom is possible. I haven’t got to it yet but I’ve read that if your character dies, you can choose your heir and that heir will continue the story and be your new character. I wish more games had this neat feature.With everything being bigger than ever; the towns, castles, NPCs, as well as the improved UI, the game feels more like a proper RPG now. I’m getting Witcher 3 vibes from this game especially when roaming around in towns or villages riding a horse. Unlike a lot of sequels that try hard to change the formula or revolutionize the series only to fail, Mount & Blade II: Bannerlord does quite the opposite and perfectly embodies the proverb mentioned above. It religiously follows the blueprint for what constitutes a Mount & Blade game, which is a great thing.For all intents and purposes, Bannerlord is basically just a remastered Mount & Blade: Warband just with a new expansion providing the new features. And this was just exactly what the people wanted. Even Bannerlord in very low graphics looks very close visually to Warband. That being said, I will try to review it as its own game with only minimal comparison to Warband. The graphics are decent. It surprised me how a game that was at one point planned for a 2016 release still comes with visuals that is passable for today's (2020) standards. Props for the effort to upgrade the graphics throughout the years. Granted it isn't the best looking game I've seen. Still, the game is an epic battle moment screenshot goldmine. I wish they could include Ansel support in the future. There are lots of weapons in Bannerlord: Bows, Crossbows, Spears, Maces, Axes, Swords, Shields of all types, and many more. There is also a weapon crafting system, a new addition to the series. Besides traditional foot combat, horseback combat is also available and a huge part of the game. There are different theatres for warfare present throughout: An open area of various terrains from dense forests, rugged hills, watery riverside, to huge open fields. Or through the different villages or castles in the world map, should you attack or defend them.Combat is fun, as expected for the series. Indeed one of the strongest points of the game. Swinging your weapon, blocking and parrying attacks, hitting and killing enemies all feels very gratifying. The AI is harder now and that’s a good thing. Compared to Warband’s buttery smooth combat and animations, Bannerlord’s take is much more gritty and realistic. Swings and animations have more weight to it. Weapons have far larger differences now in terms of speed and reach. They react more realistically when hitting objects. Unfortunately this results in huge balance issues for the game that they need to sort out. The game maxes out at 1000 units, meaning you can have 500 vs 500 battles which is a huge amount of NPCs fighting. It really feels immersive going into battle and gives me that Lord of the Rings vibes. (can’t wait to play LOTR mods in the future!)One major key feature that I’ve found missing is the auto-block option for at least the singleplayer. This was actually the default option for the previous games so naturally a lot of old timers are requesting it back. For now, all players are stuck with the competitive style directional blocking. This makes non-shield type melee combat inaccessible for a huge amount of players. At the same time this makes shield or ranged combat the unquestionable superior types of combat.In my opinion, Bannerlord really needs the early access treatment, for better or for worse. With the first game being one of the first titles to go on early access before it was even called early access, having the second game follow a similar direction is just fitting. For a game with such scope and ambition, it is more effective to tap into the playerbase; old and newcomers alike, before going on full release. Thousands of players playtesting the game is much better than having an internal or limited access playtesting only. Sure, they could have gone instead with a free beta access and offered a pre-order option only for those willing to pay. But it’s basically just Early Access in the grand scheme of things.Despite being in an already playable state, the game still needs a lot of work. Especially in the singleplayer campaign. Questlines are unfinished and lacking in content, textures missing, and maps being reused. Some features are to follow or a work in progress. Should you play this game right now, prepare to find a lot of placeholder text for basically everything. Warband actually feels more like a better and solid game right now when it comes to these aspects.The game ran passably on my setup: i7-8700k, 32GB RAM, and GTX 1080. Hovers just around 50-60 with everything maxed out and testing a 500 vs 500 NPC battle. It’s a CPU heavy game so no matter the resolution or graphics settings it still plateaus at around 50-60 FPS when the game gets very demanding. As a high refresh rate user, it’s a bit disappointing. But this is one of the rare cases where I would trade my precious 100+ FPS for 50+ FPS just to experience huge epic battles. I've only encountered one graphical bug so far. During battle, some parts of the screen bugged and turned into black squares. I couldn't see 80% of what's happening. I reloaded my save and so far it never came back. Despite all the current issues, it’s still a yes for me. Mount & Blade II: Bannerlord already has all the hallmarks of a future great open-ended sandbox game. The foundation is already in place, it just needs that extra time in early access to tie up all the loose ends. If you want a fully polished solid experience at your first playthrough, I would suggest waiting it out. Either by still buying it now at a discounted price to encourage and support the devs, or by playing it safe by waiting for the final release before deciding to vote with your money.\"This product was reviewed with a key provided by the developer for free\"", "helpful": "1,004 people found this review helpful, 24 people found this review funny", "recommendation": "Recommended", "rewards": 0, "hrs_on_record": 20.2}, {"text": "If you're deciding whether you should wait to buy the game, or go for it now it all comes down to how much perfection you expect from a game in early access.All issues I have experienced are minor, there have been no crashes, or major gameplay issues. All issues seem to be visual, with the graphics not looking as good as the videos and promotional pictures, but still overall pretty good. Minor other issues, such as starting battles in first person and seeing the backs of your eyes/eyebrows are the greatest problems I've encountered. Those are solved by switching from first to third, then back to first person so it's not the end of the world by any stretch of the imagination. If minor graphical issues are a dealbreaker for you, save your money until a few updates come out and maybe invest it in some chill pills in the meantime. If you're okay with a game that's perfectly playable, though a little rough around the edges, you won't regret buying the game. Overall Bannerlord is a massive improvement over the originals and I'm very happy with my purchase.", "helpful": "2,399 people found this review helpful, 115 people found this review funny", "recommendation": "Recommended", "rewards": 3, "hrs_on_record": 557.3}, {"text": "Awesome but wish there was a multi player world campaign mode", "helpful": "334 people found this review helpful, 7 people found this review funny", "recommendation": "Recommended", "rewards": 28, "hrs_on_record": 186.1}, {"text": "I didn't expect to play this game in my lifetime.", "helpful": "4,659 people found this review helpful, 3,914 people found this review funny", "recommendation": "Recommended", "rewards": 5, "hrs_on_record": 27.4}, {"text": "1100 hours in annnd...The game is fun, no doubt about it, but for the most part it's a prettier Warband.  Without mods the game is pretty barebones in content.  The game is not hard.  Once you've hit lvl 30+ a few times you can steamroll the game.  If you are going to make you own kingdom, in order to recruit other lords you will have to chase them down to give gifts or release them after battle to get your rep with them high to recruit them.If you have multiple towns the rep notifications from the Governor with the merchants of the town is non-stop.  Each notification has a sound.  In my current playthrough I get so many that they actually queue and lag behind.With the Perk system, some are useful.  Overall most are worthless.  This is due to the fact that each perk has a role.  Like, Personal, Captain, Governor, Party Leader.  Governor perks are worthless to player.  Players can't be governors.  Others are role specific Surgeon, Scout, Engineer, Quartermaster.Companions are essentially non developmental.  Scouts will increase their Scout skill.  Surgeons just stop at 160ish.  Engineers won't go higher than 100ish.  They learn other skills at an abysmal rate therefore they barely level.  Maybe 2 levels if you're lucky.Sieges are plagued by the AI and player controlled soldiers not using ladders, siege towers and engines in a reasonable fashion.  If there are 2 ladders to one side to scale a wall, only one will be used.  Some siege towers have 3 ladders.  Typically 1 is used normally but you might see 2 every so often.  Very rarely 3.Now what I consider to be the absolute best part of the game.  You will spend 90% of your time on the campaign map.  Moving around fight, recruit, siege, defend, etc.  You will do this all at a whopping 6-12 frames per second.  The menus load slowly.  The last 3 to 4 patches have dramatically reduced the campaign map performance to a level that is 1 more headache away from never playing again.  Battles are just fine and have normal FPS.  Taleworlds is indicating this might, could possible be a bug and have no ETA on a fix or if there will be a fix.  With release happening this year.The very fundamental basics of a good game are there.  Taleworlds just hasn't done anything with them.  They also haven't appeared to want to do anything with them either.  Rumor is they've moved on to another game or are working on DLC leaving this one to wallow in the depths of slow development.Would I recommend this game?  If you like M&B and have the cash then have at it.  If you're on the fence, buy Warband instead.", "helpful": "263 people found this review helpful, 6 people found this review funny", "recommendation": "Recommended", "rewards": 18, "hrs_on_record": 1.0}, {"text": "Good old game redefined. Devs quick patching after the release. I think the future is bright", "helpful": "446 people found this review helpful, 16 people found this review funny", "recommendation": "Recommended", "rewards": 1, "hrs_on_record": 20.7}, {"text": "F1 + F3   - Sun Tzu", "helpful": "438 people found this review helpful, 518 people found this review funny", "recommendation": "Recommended", "rewards": 85, "hrs_on_record": 70.1}, {"text": "The paradox of this game is that I waited so long for the final version that I finished school, then college, started a family, and now I don't have time to play it. When the children grow up, the sea will play :)", "helpful": "266 people found this review helpful, 163 people found this review funny", "recommendation": "Recommended", "rewards": 18, "hrs_on_record": 102.7}, {"text": "It's buggy, it needs optimisation and it needs balancing but ♥♥♥♥ me it's one of the best things I've played in my life. The devs have been addressing these issues and have released an update everyday for the past week, it'll keep getting better with the future plans and mechanics they hope to add, ye love to see it.", "helpful": "163 people found this review helpful, 8 people found this review funny", "recommendation": "Recommended", "rewards": 0, "hrs_on_record": 155.9}, {"text": "In this game I became the Medieval Military Industrial Complex.Orestes was a simple man,After his village was raided by bandits, he took it upon himself to form a small caravan. He went from Lageta to Ortysia to Sargot and back trading commodities such as horses, wine, grapes the like. One day his humble caravan was beset by looters. This battle awoke a bloodlust in Orestes that he could not control.Looking south Orestes invaded the lands of the sand people and defeated a small army. Its general by chance, the very Sultan of the sand people was taken to Orestes, who had him decapitated. There would be no quarter to the barbarian pagans of the deserts. What ensued was an absolute bloodbath, over 30 nobles slain in guerrilla warfare, scorched earth tactics. Towns all over surrendered their meager #3 quantities of cheese and butter, and also their hobbled weapons and tools. The campaign would soon deplete Orestes saved up fortune and he was forced to turn back to Ortysia. There he discovered his new passion as a salesman of the finest boots and headwraps. But this was not enough, curious one day Orestes visited his local smith and forged his first sword. In the span of a few weeks Orestes would forge so many weapons as to rival Hephaestus himself. His swords soon sky rocketed in value and he was able to bankrupt the entire city's economy with the sale of a single one of his Signature Two-Handed Polearms, titled: Mars.Orestes would then take up arms again. This time acquiring the Dragon Banner of Calradia and claiming rightful fief of all of Calradia. Barbarians would no longer sate his blood lust. At the sight of the first castle, Garonter, Orestes would besiege with a force of 100 veterans against the castle's 230 garrison. It took him 3 weeks to build his siege engines and in 3 weeks he was beset daily by the Empire's best men, even their emperor Garios. All would fall to Orestes with the clairvoyant power of the F5 quicksave. His kill count would rise each battle, until night before the siege, Orestes himself killed over 100 men in single combat after the garrisoned had sallied forth from their gates. It would be after this that Orestes made peace with the Empire, went back to Ortysia and crafted 30 divinely infused and crafted polearms, each worth 40k and donated them to the towns under his fief. Within 3 weeks he was churning a profit that fuel his further expansion into Thoracte Castle, Tubulis Castle, Sargot, Quyaz and now Ortysia itself.Now Orestes raids the wastelands of the desert, slaying man and woman alike. His nations economy runs on him conquering the Saracen heathens. Smelting down their impoverished weapons to craft ones divinely inspired by God himself, then selling these majestic pole-arms and the fallen solider's boots back to his people, who then sell those at even more inflated rates back to foreign nobles travelling through town.", "helpful": "479 people found this review helpful, 286 people found this review funny", "recommendation": "Recommended", "rewards": 150, "hrs_on_record": 233.4}, {"text": "I've been sitting here for a little while trying to decide whether to recommend this game or not. I know that's a strange predicament for someone with 265 hours on record at time of this review, but let me explain;This game is great, there is a lot to it and the files can be edited to make the game align more to your taste.However, the AI is bad.And I mean BAD.On campaign, I've joined an army which gathered at a village which was very close to a friendly castle which was being besieged. Our army was larger than the besieging force, but the army leader decided to ignore that and head North to almost the other side of the map to raid a village.In battle, the army I was in advanced toward a Battanian army which positioned itself quite cleverly at the top of a steep hill. Our army stopped and stood at the bottom just taking ranged attacks, they finally walked half way up the hill, but then turned around, presented their BACKS to the ranged enemy and walked back down. They did this about 4 times before finally charging up the hill. The battle was won, but there were so many avoidable casualties taken.In siege, the AI doesn't understand ladders. when they lift the siege ladders, they only use one of the two if they use them at all. Sometimes they just stand at the base of the ladders and do nothing. The AI is slightly better with Siege towers, though with laddered siege towers, the defenders have a habit of climbing down the ladders and literally start fighting on them, until one of the attacking artillery pieces destroys its own siege tower.These are just single experiences I've had from an absolute ton of them, but I will still recommend this game, there is still so much on offer, and it's early access, so there is still time for these AI problems to be addressed.", "helpful": "138 people found this review helpful, 11 people found this review funny", "recommendation": "Recommended", "rewards": 4, "hrs_on_record": 292.6}, {"text": "This game actually has come a long way. There are still problems here and there but it's one of my favorites.If this game is in your wish-list, you don't need to worry about it so much now. Since there are still some upgrades to make AI more competitive instead of just execuding the same if-else code.No need to rush your purchase. Wait for discounts to get this game.", "helpful": "127 people found this review helpful, 3 people found this review funny", "recommendation": "Recommended", "rewards": 7, "hrs_on_record": 281.9}, {"text": "I made a javelin worth 160k gold but couldn't sell it because no one can afford it10/10", "helpful": "163 people found this review helpful, 134 people found this review funny", "recommendation": "Recommended", "rewards": 9, "hrs_on_record": 171.0}, {"text": "It's unfinished and it already makes Warband completely obsolete.", "helpful": "806 people found this review helpful, 52 people found this review funny", "recommendation": "Recommended", "rewards": 0, "hrs_on_record": 226.1}, {"text": "2k hours of gameplay on in multiplayer, i can now say this game is not worth it, unless you only enjoy playing single player.", "helpful": "97 people found this review helpful, 1 person found this review funny", "recommendation": "Not Recommended", "rewards": 1, "hrs_on_record": 2.0}, {"text": "Even in early stage is great fun.I like to come and play it a few hours every month or so, so I can see the progress.So, in my opinion is like a better Mount & Blade :) I just want them to keep adding stuff in it.We all know that the first was not perfect but still played it to death, so more is better here.But please add more quality of life stuff, we are in 2020 not 2002.", "helpful": "267 people found this review helpful, 12 people found this review funny", "recommendation": "Recommended", "rewards": 21, "hrs_on_record": 96.9}, {"text": "Bannerlord 8/10EDIT: Features suggested by a lot of players including myself are being implemented into this game. Like diplomacy, rebellions and much more. Huge respect to the devs for actually listening to the community. It's a good time to get it.PAST REVIEW8 long years and this is what we get. It's not really a huge leap when compared to its predecessor. In terms of graphical fidelity sure but veteran warband players will still experience more of the same thing and much of the dialogue is a copypaste from the previous title. Speaking of voice acting, there is hardly any. While the architecture is now more grand and detailed, players will still have no reason to explore different parts of a city and fast travelling can be done via TAB menu. There are tons of things that are completely incoherent to the setting. The villages as described by the game to be rich and flourishing are empty. In fact, it doesn't matter how prosperous it is, you will still see the same farmers working the fields. They should add more villagers each with their own things to say to make the environment believable. Castles have few guards without any noble residing in it In character customization, you can't select presets. You can't sculpt your character's face according to race/faction. The quests from the previous title are petty chores and they're imported into this game as well. New merchant quests in particular are non-sensical and pointless. I'm sure a lot of players would appreciate if the devs could create a more story driven campaign with voice acting in addition to its already solid sandbox foundation. Court advisors and viziers should be the intermediary during dialogue to show that a king isn't simply some peasant you can talk to. An audience granted by a king or sultan must be sought, earned and being in their presence should be an honour. Being knighted and swearing allegiance to them, a prestigious moment to elevate a sense of purpose for the player. Even more so to imagine what it would be like for the player to be sitting on that very throne. Medieval nobility here are puppets to be exploited. Instead why not give them their own unique personalities with their actions and yours affecting political climate and change of attitude among them. NPCs are just programmed to war with each other with no proper implementation of diplomacy. If the player eventually rules a faction, why can't the ruler send an emissary to a neighboring kingdom to open up favorable diplomatic options. Why would there be a feature to dress casually if it didn't affect your status or charm. There should be different and interesting dialogue options when speaking to NPCs. Female players should be able to curtsy and dance in accordance to the faction's culture. What's a medieval age without upheavals? There should be demagogue usurpers from a starving populace hellbent on overthrowing a crazy monarch. These are examples of how you add depth to a sandbox game. Despite all this, I can still recommend it to players who have never played mount and blade. This is simply an upgraded version of the previous title with a simple economic system, political system based on influence, tournaments and the new blacksmithing feature. The battles are still epic as ever with a plethora of medieval weapons, armor, accessories and horses for yourself and your companions. As for me, I'm going to wait for for the devs to actually make use of the financial support they're getting and release a major update worth playing.", "helpful": "637 people found this review helpful, 27 people found this review funny", "recommendation": "Recommended", "rewards": 100, "hrs_on_record": 28.9}, {"text": "This is everything I had hoped for in this game, even in EA.. Is it 100% finished? Of course not, but certainly 85-90%. Some things need to be fully added, some things just aren't functional. The reputation system is not perfect yet, as it's very hard to gain rep with others, but very easy to lose it. But the economy is super fleshed out. I started as a merchant to get myself going and could easily see how my efforts were effecting cities I traded in, their prosperity, and thus mine as eventually I owned workshops and saw them flourish as I made sure they had the necessary items to produce goods. As far as performance goes, I don't really have much to complain about.. It runs fine on my machine and only super-massive battles do I see frame drops in the start.. Sometimes it does crash, but I'm used to frequently hitting that F5 button (quicksave) so even if I do, it's only a few minutes lost.. I have sort of seen the \"snowball\" people talk about, but in my experience each time it happens, the faction eventually crumbles.. There are a lot of NPCs and they certainly flock to strong factions. I think it will be more manageable in my subsequent playthrough now that I know a lot more.. All in all, this is shaping up to be just as legendary as the original. I didn't expect a perfect game from the start, but am still impressed about what is in the game and functioning now. There are many things that are clearly placeholders and things you can see have a presence but not fully functional... That is fine with me.. It is now Friday - the game came out Monday.. so in 4 days I have 75 hours played.. And I am not a \"fanboy\" by any means and wouldn't blindly praise something just because... In fact the original game I played more of the GoT mod than the regular game. But for $40, I have already surpassed my criteria ($1 per hour) of getting a good game with value. I am sure I will have a decent amount more as I finish up my campaign and maybe another soon.. But I also know that when the game is fully released, I will double my time again to experience the full force.", "helpful": "399 people found this review helpful, 15 people found this review funny", "recommendation": "Recommended", "rewards": 2, "hrs_on_record": 161.1}, {"text": "It's bigger, better, beautiful and oh yes: in early acces.Even with the devs working on it constantly it's amazing to play.I've had my share of crashes and then a new beta came out and: fixed.The game isn't perfect yet but it will be.There's so much good in this game and the devs will support all the modders to make their amazing stuff too.Honestly: these devs deserve your support. The game is already great fun to play. If you loved Mount & Blade: Warband then get this now, you'll be mind blown.If you don't know about M&B:W but you love making your own path in a sandbox world full of danger and excitement, well then fellow traveller, I could use someone like you in my army :)", "helpful": "251 people found this review helpful, 10 people found this review funny", "recommendation": "Recommended", "rewards": 4, "hrs_on_record": 420.0}, {"text": "This is by far one of the better games I've played. Even when this game lacks a compelling story, unique NPC's, and is flooded with bugs, I still enjoy this game more than titles of this genre. I got married, have like 3 kids, my own kingdom an army of like 100+ goons and own a couple villages. I commanded armys to raid castles in bloody, close, combat battles and when I win I can't help but to feel like a badass. Just the title screen and music do it for me. for that reason I overlook the flaws. This game is jam packed with stuff but often feels repetitive. The story isn't the greatest, but the game litterally drops you in and you basically conquer the world the way you want. Be a warlord or a merchant, side with person A or person B, you have options. High replay value. I just wish the NPC's had uniqueness really and the leveling gets slooow. I don't usually write reviews but I hope this helps someone!", "helpful": "126 people found this review helpful, 3 people found this review funny", "recommendation": "Recommended", "rewards": 4, "hrs_on_record": 91.3}, {"text": "I like imagining I'm rich and I control the world in this game, because in real life I'm a nobody. This game will help you feel productive in this amazing simulation game. Makes me feel important in a sense of literal hundreds of imaginary people depends on you. 10/10", "helpful": "219 people found this review helpful, 98 people found this review funny", "recommendation": "Recommended", "rewards": 24, "hrs_on_record": 135.6}, {"text": "Most of the negative reviews for this game are people who bought it early on and saw how little this game progressed through the passing of months, positive ones are the ones with few hours, because I indeed agree, it feels like a new game completely, which is good (as there was already plenty of content for Warband through great mods).However, what surprises me the most is that they say this game will be released June next year? (sourcing themselves: . How come? Game is far from finished and absolute snail’s pace of development will for granted not finish it in a few months, when this game has been going on for years and since they launched it on steam on early access prepurchase, they have mostly been doing minor fixes and balancing. No new features, quests or dialogues since I last played to this dayGame is enjoyable early on. I like that there's a main quest that adds special events to the gameplay (unlike in Warband), but there's only one and its pretty straight forward, on every new game you do... combat feels good, but besides that, talking to a lord is always pointless unless he has a task for you (no options whatsoever), sieges get (like in Warband) to be repetitive, but here, there's bugs that make sieges way more difficult than it should be. Fief options are very limited. Marrying has little use besides getting a free companion, selecting a bride for your brother is literally useless.This game as of December 2021 feels okeish but still a shell, unfinished product, and if you watch the pace at which they've been adding patches and specially, at the scarce amount of contents within these patches, you already know this game will not be finished for June 2022. At least, I hope they allow mods to fix all the stuff that was meant to be fixed already when game releases, but it still feels wrong for a 50€ game which has been 2 years in Early Access and many more on development.", "helpful": "1,283 people found this review helpful, 21 people found this review funny", "recommendation": "Not Recommended", "rewards": 102, "hrs_on_record": 316.0}, {"text": "Quarantine just got good.", "helpful": "510 people found this review helpful, 420 people found this review funny", "recommendation": "Recommended", "rewards": 0, "hrs_on_record": 41.6}, {"text": "Soup just ain't done yet. But hell, it is soup.", "helpful": "329 people found this review helpful, 144 people found this review funny", "recommendation": "Recommended", "rewards": 78, "hrs_on_record": 413.9}, {"text": "I have never clicked on a game and paid $40 faster in my entire life.10/10 would do it again", "helpful": "1,273 people found this review helpful, 507 people found this review funny", "recommendation": "Recommended", "rewards": 2, "hrs_on_record": 249.8}, {"text": "I would first recommend this game to the players who are more open world / medieval combat oriented. Games like Mordhau, Kingdom Come: Deliverance, Chivalry etc.. are the reasons I fall into this category, and if you like any of those games or any similar to that. You will already like Bannerlord before you realize it. But to those who aren't familiar with M&B, a half decent summary would say it is a medieval sandbox where your goal is to be the strongest faction on the map by whatever means necessary.   TO THOSE WHO PLAYED M&B WARBAND:Many would consider this to be a continuation of this game, and I'd have to agree. It is not a bad thing because I believe there is a lot more content being added and a lot of problems that have been solved since then. Combat mechanics are the same, with some ai differences and new weapons/armor. New perk trees/concepts for you and your companions. Bannerlord also added a questline that nudges you along towards total domination, either by you or your ruler. Oh and also, when you feel like skipping the battle and just sending your troops in, they fixed the chance system for how likely characters are to die. So rest assured you don't have to worry about one sea raider killing multiple of your hundreds of troops What I found to be the strongest points that make this game shine:-A free roam concept where you do as you please. You can serve/fight for whatever faction you wish, including your own. You can interact with characters  and so on.-You are able to participate in open battles with hundreds of units on the field, commanding different types of troops to do different actions(face a certain direction, make a formation, hold fire, follow you) and many others, or if you're a part of an army filled with other nobles, then you lead one type of troop (infantry, arrows, cavalry, horse archers) under your commander. Regardless you are going to take a step back when you first see dozens of cavalry rolling over the hills in the distance, or when your commander gives the order to charge and you have to join the front line where chaos is the only thing that is happening. -Siege events with a lot of potential for strategy, I say potential because if you decide not to set them on auto the troops are only as effective as you are at commanding them, but as far as content there is a lot going on. Between manning a catapult to try and take out their siege tower, and making sure that the troops are holding the line at the main gate where they've broken through. It takes a lot out of your hands as you try to make it all happen on the keyboard. and it looks really intimidating seeing hundreds moving troops outside your walls. -very smooth trading system in markets and with npc's (it's still in EA so frame rate drops, load screens still happen but that is something that will be smoothed out) -music music music, I love the MUSIC! Consistently M&B proves that not all gaming companies are giving up on going above and beyond for their soundtracks. The only negatives I have for this one is that there isn't enough of it and I wasn't there in person to hear it being performed. Sadly I found some things to be negative points about the game. This is kind of difficult to tell since it is in EA, so things may be added/changed/fixed after this post so I will focus on content that is there now rather than bugs and whatnot. -AI isn't the smartest, if you're not the commander and you are only in charge of one troop. Then they go on to do whatever they want to, and it may not match up with what is considered the best strategy. At the beginning of each battle you spawn on opposite sides of the map. One battle my commander thought it best to go backwards and to the left up a hill with a bunch of trees. Pushing the boundary of the map, I had to figure out where I was going to put 200+ archers so that they could see and fire at the enemy. -You only know as much as you research. What I mean by this is that the only tutorial you get is the combat and how to use different weapons/shields. Arguably this isn't a negative, but I deem it more negative than not because there are a few menu/keyboard tips that would help to know early on. As silly as it sounds, I spent more time than I should have looking in the vendors inventory for food because I didn't know that the category filters were at the top of the screen. Or how I wanted to look characters/locations up to know what faction they were a part of, or to find them but couldn't until I accidentally pressed n and opened the encyclopedia. They have already added a mechanic that lets you click rmb to open the encyclopedia on a certain items but that doesn't solve the entire issue of the average player being clueless. Right now when you press esc in game there is a list of tips you can look through on the left which is a plus, but I hope they add more because it doesn't solve as many questions as it could. All in all the game is great and any of the negatives I've found don't outweigh the positives. If you were sold on the game after a few points then you're going to love it regardless of whatever you dislike about the game. I bought it not only because it appeals to what I like in a game, but also because I believe TaleWorlds is capable of reminding players what their standards should be for a great game. Anyways I hope this helps!", "helpful": "89 people found this review helpful", "recommendation": "Recommended", "rewards": 7, "hrs_on_record": 133.7}, {"text": "As someone who followed this project very closely on the official forums I have to say that TaleWorlds is an absolute garbage at their job. They are sidelining the community at every opportunity. They have a track record of hindering any and all attempts of their modding community at fixing their broken game and have shown actual jealousy over the work of their modding scene.Almost two years ago TW proclaimed that custom, moddable servers can't be made now, but they'll be a thing in 2022, which prompted the modding community to making their own custom servers in few days of work, all by adding few lines of code. TW of course threw a hissy fit over it and patched it out, but it at least shown us how incompetent they are at their own jobs.\"It's early access, you have to lower your expectations\" - My expectations are so low that I had to dig a hole for them to lay in.This game should have never been released in Early Access. You need tons of mods to make it actually feel alive and fun, something which TW is actively hindering by throwing tantrums at all Total Conversion modders, because once again - players can do a better job than the actual devs.This whole development process is a farce from start to finish. I honestly hope that when they (maybe) eventually release their 1.6, they'll adress all these issues and stop sidelining players with corpo-talk and tantrums. But it's TaleWorlds, so the reality is that they're probably limiting our possibilities to milk us on future in-game-transactions and mediocre DLCs.I wish we got the same treatment Warband did with Viking Conquest, which was a joined project of both the developers and the community.Forums topics I'm referring to in the review are 'An open letter from the Kingdoms of Arda team, and the total-conversion mod community' and 'Multiplayer mods can't be made until 2022 unless we find an alternative', but there are literal hundreds other posts and topics there that show how out of touch and jaded the devs are. I will be posting links to the topics mentioned above below (assuming steam won't delete them)and", "helpful": "1,404 people found this review helpful, 34 people found this review funny", "recommendation": "Not Recommended", "rewards": 168, "hrs_on_record": 91.0}, {"text": "My wife keeps having babies. We're on our 6th one now. The only problem is that its been when I'm not around... Pshhh, I'm sure its just a bug.", "helpful": "277 people found this review helpful, 1,165 people found this review funny", "recommendation": "Recommended", "rewards": 8, "hrs_on_record": 131.7}, {"text": "A worthy successor to Warband, but it still needs more time in the oven. Mods fix some of the bigger issues. I'd rank it as a must-play if you were a WB fan or if you've ever wanted to play a Total War game as a 3rd person RPG of sorts.Pros:+ Looks good. Many times, even better than the screenshots on the Steam store.+ Moddable.+ Gorgeous soundtrack.+ The core gameplay loop is awesome. It feels good to go from zero to hero. You eventually find a favorite weapon that suits your play style and smithing can let you obtain an even better version of it.+ Battles no longer end when you die, and you can fast-forward the remainder of the battle, which is very nice.+ A lot of the crashes that made the game almost unplayable near release have been fixed. In 1.6.2 I got about one crash every 3-4 hours, and that's while running 10+ mods, which is pretty good in my book - just save often.Cons:- The first and biggest issue is the way experience works. Because new levels ask for exponential increases in skill levels while decreasing your learning rate, reaching mastery in any skill takes an incredible amount of time. I get that, realistically, you could only hope to master one, maybe two things during a lifetime, and the game wants to lean towards realism. I just wish the game also offered you the choice between realistic and \"power fantasy\" when it comes to skill leveling, because the game is a lot more fun when you can personally take out 30-50 enemies before formation combat even begins.As of 1.6.2, you can address this by using the Leveling Rebalance mod, possibly in combination with the Kaoses tweaks mod. Unfortunately, mods frequently break during new updates, so this will be a recurring issue.- Endgame kingdom management should have some auto-resolve options, such as \"give fief to noble with most council support / highest relation / lowest relation\".- There should be a way to contact lords without having to find them on the other side of the map. Couriers and emissaries would be a way. You should also be able to talk with them while they're in jail, at least if it's your jail.- The AI could use improvements. Riders still frequently crash into trees, ladders are sometimes ignored during sieges, cavalry attached to infantry formations will ride ahead to their death instead of staying close. Archers in the same formation will prefer forming one vulnerable long line, unflinching even when clearly being overrun by cavalry/infantry, instead of splitting up and moving around during AI control - which I imagine is a limitation of the formations system - but I wish the AI itself could handle smarter splitting of troops. Enemies will constantly stream at you when respawning instead of trying to regroup and have a sizable force for a new wave, though your troops are guilty of doing the same. Also, during sieges, one unit will sometimes get stuck and you can't end the battle without exiting the map and restarting it.Still, it is generally competent enough to make the gameplay fun, I just feel like it's a few steps away from being truly great. I hope to one day come back to it and replay it as an RTS where I dodge the occasional arrow, with troop command being a fully viable play style.Overall rating: 8 out of 10 Swadian butter caravans. Some changes to the way you gain experience and how the AI handles itself, as well as further improving on game stability would bring it over the finish line, and all of these seem doable with time.", "helpful": "83 people found this review helpful, 2 people found this review funny", "recommendation": "Recommended", "rewards": 5, "hrs_on_record": 105.1}, {"text": "TL;DRFor any fan of the Mount & Blade series, Bannerlord is an easy choice:  Yes, get it!  It's worth the price even in Early Access.  I've played Bannerlord from day one and can honestly say the current game has drastically improved since the public release.Essentially, the player starts as a skill-less, worthless, unknown peasant and begins earning his/her salt by fighting up through the ranks.  Exactly what you do is your choice:  Become the right-hand man of a King/Queen or develop your own kingdom.  Stay independent and deal in trade as a merchant.  Rogue it up by ransacking villages, traveling civilians and caravans.  Be honorable or a miscreant.  There's no linear path but choices have consequences, good and bad.The start can be rough and a bit of a grind, but once you've saved enough money to hire some troops, purchased a few shops, hired some caravans and made some noble friends, then the game really takes off.Key highlights:Pros+ Open World, Sandbox+ Combat is mostly fluid and satisfying.  Certainly not a combat simulator, but requires just enough 'skill' to be more than a simple button-smasher.+ First person perspective combat; and 3rd person for you weirdos out there :P + No specified roles.  Fight on foot or horse.  Fight with sword, ax, pole-arm, bow & arrow, etc.  Heavy armor, light armor or no armor?  Shield or no shield - that is the question!+ Progression.  There is a noticeable difference in combat as your character improves as well as your \"companions\" (NPC's whom follow the player).+ Skill Tree.  A wide variety of skills that definitely impact game play.  + Inventory Management. BIG improvement over previous titles. + Family system.  Can marry and have children.  Children become heirs so the player can continue playing once the original character dies from old age.+ Companions.  Various NPCs have unique skills.  Use them to your advantage (warrior, trader, engineer, surgeon and more).+ Town & Castle Management.  Can build improvements to fiefs that impact security, garrison, income, growth and a few others.  Pretty basic.  Improved over previous titles but needs love.  See Neutral for more info. + Gangs.  Every town has a gang that may or may not own a shop.  Can clear them out of towns (temporarily) to gain favor of from merchants or other gang leaders.  Impacts your reputation and relationships.  I believe future updates will incorporate more uses for them.+ Shops.  Can purchase shops in town as an easy way to earn extra money.  Read a guide on how they work.  Not much to them but some things aren't apparent.+ Graphics are nice.  Nothing next-gen but still eye pleasing.+ Developers - they continuously add updates and meaningful changes.  Yes, there have been a few broken patches, but it doesn't take long before they're corrected.+ Hundreds and hundreds of hours of game play.  I'm not even sure if there is an \"end\" unless the character dies with no heirs?Neutral-+ Story-line - it's just 'Meh'.  Regardless, it has been improved and expanded.-+ Equipment (weapons, armor, etc.)  There is already an impressive amount of gear, but I do hope they add more, especially for armors and cosmetics (civilian clothing).-+ Town/Castle Management.  Simply needs more depth and complexity - a bit too basic as is but not enough to warrant a \"con\".Cons- Hit registry.  Usually good, but will definitely experience instances when the player's weapon passes through enemy with no damage.  - AI.  Friendly AI love to block your attack, your path and overall be a nuisance.  Common to have nearby friendlies block your attack on enemy, while enemy AI happily ignore the shields of friendly AI.  It's just aggravating and weird.- AI pathing.  Has been improved but still an issue.  AI don't always climb ladders or siege towers, but rather stand at the bottom while arrows rain down from above.  Perhaps they drank too much mead before battle?  (Helpful tip:  sometimes the problem is one moron blocking the ladder.  An arrow to this guy's face may unscrew the screw up.)- Lighting.  Some objects, like plants/bushes and rocks, bleed light (casts a glow around or under them).  Some flickering issues in certain areas.  When characters or horses run, they kick up large clouds of dust and it's very reflective.  All minor issues.- PC requirements.  You'll want a fairly beefy system to enjoy large battles and high graphics but a mid-range setup and lowered settings can play adequately.  My settings & PC setup @ end.Areas to Improve:- Hit registry needs love.  It's not horrible, but can be very aggravating at times during critical moments.- Barter screen.  The slider scale is too sensitive when trying to adjust large amounts of items or currency.  Also, the mouse delay for holding left-click is way too long before items increase or decrease.- Some areas in towns or battles have light flickering or light bleed (under rocks/plants) during certain times of day.Playing at 2560x1440 on mostly high settings, averaging 100-120 frames during battles.9900K @ 5.2 Ghz32 GB DDR4 @ 3200 MHz (CL 14)2070 Super (OC)Installed on SSD", "helpful": "150 people found this review helpful, 4 people found this review funny", "recommendation": "Recommended", "rewards": 21, "hrs_on_record": 957.2}, {"text": "As an adult gamer with parental responsibilities, this game is a perfect way to conquer the pretend world, while being able to pause as real world raises its demands for things, such as grilled cheese sandwiches. I purchased this game when it released in March 2020, but only really got to playing it as of September 2021. #firstworldadultgamerproblems. So, the current version I'm playing vs the original release that I dabbled in for a few hours, show a lot of incredible and quality updates. I haven't even bothered with mods as the vanilla game has kept me entertained for over 150 hours at the time of writing this.", "helpful": "174 people found this review helpful, 11 people found this review funny", "recommendation": "Recommended", "rewards": 25, "hrs_on_record": 201.7}, {"text": "***ONLY BUY THIS GAME IF YOU HAVE AN SSD***This game is not built to be able to work on HDD memory, it's too slow. Every time you trade, fight, use a menu, level up, manage your army, enter a settlement...pretty much anything, it'll slow to a snail's pace unless you have the game on an SSD.", "helpful": "162 people found this review helpful, 5 people found this review funny", "recommendation": "Recommended", "rewards": 4, "hrs_on_record": 143.8}, {"text": "Come back in around a year or two, trust me you'll be amazed.", "helpful": "254 people found this review helpful, 25 people found this review funny", "recommendation": "Recommended", "rewards": 21, "hrs_on_record": 1.0}, {"text": "Enjoyable? Yeah. Will it ever be finished? Who knows.", "helpful": "127 people found this review helpful, 46 people found this review funny", "recommendation": "Recommended", "rewards": 2, "hrs_on_record": 19.7}, {"text": "If you are scrolling through the reviews for this game you may notice that most of the positive reviews allude to how great the game \"will be\" or how they can't wait to see \"how it will turn out in the future\". While there is certainly a case to be made for that, I think any potential buyer of this game needs to be aware of the current state (as of March 30th 2021) of the game.The skeleton of the proposed game experience is in place. You can run around a map fighting looters and armies, or you can join a kingdom and do so, but that's pretty much it in terms of things that are working as they should. There is a lot of big fixes that still need to come after quite some time of being in beta. This has left the current game community rather frustrated as the devs keep making small fixes for minor issues no-one seemingly asked for, and all but ignore big long-standing issues (i.e. siege AI) that people have practically begged for. The devs have also alienated all of the major players in the modding community (which is what is currently keeping the game alive) by ignoring their pleas for better communication on up-coming fixes and not listening to their suggested (simple) fixes for alot of the larger issues plaguing the game. This resulted in said modders creating a open letter to the devs voicing their displeasure with the current state of the game and the devs communication, and announcing their abstaining from modding till improvement in these areas.Will you get a couple hours of fun out of the game as it stands? Yes, but you need to note that the game is very bare bones currently and that modding is going to be constant process of updating and reinstalling as the game updates and breaks all mods and you previous save-game compatibility. Is it worth the listed price? For what it currently offers, absolutely not, get it on sale if you must, or wait till final release. As a long standing fan of the franchise I'm left with a pretty sour taste in my mouth but I'll continue to check in and remain hopeful that future fixes make the game more playable and enjoyable.", "helpful": "773 people found this review helpful, 31 people found this review funny", "recommendation": "Not Recommended", "rewards": 108, "hrs_on_record": 634.2}, {"text": "I wanna start off by saying I really enjoy this game, and I've been playing the hell out of it for the past week at the time of writing. I bought the game on launch, and honestly I was pretty unimpressed and decided I'd wait a while then come back to see how things were going. With that out of the way, here's some of my thoughts on where it's at right now:I cannot recommend anyone to buy this game in good conscious unless you genuinely don't care about value for money. The game is still M&B, if you loved Warband, you will enjoy this game. The problem is that there's nothing at all beneath the surface gameplay. The choices you make and the people you befriend or make enemies of simply do not matter at all. The game outside of combat feels extremely lifeless. Every NPC says the same 2 or 3 lines. Your dialogue choices don't actually matter either. Companions have less depth than Warband, and spouses might as well just be your acquaintance that occasionally carries your child. Towns and villages are absolutely dead as well. Taverns are especially funny, with musicians consistently playing invisible lutes and maidens pouring ale until the end of time. Don't get me wrong, the gameplay is obviously the major selling point, but at $50 I was hoping for a world that's at least more interactive than Warband's, not somehow less.The AI is incredibly easy to manipulate and often quite stupid. You can stop any siege in it's tracks by starting a siege on something of theirs close by. There's almost no semblance of actual strategy for your allies or enemies in battles as well. 99% of large battles have one or both sides forming an infantry circle around their archers and letting the cavalry fight among themselves. You haven't experienced true hell until you get knocked out in the arena and all that's left is two horse archers circling each other for 20 minutes, missing every single arrow until they finally have to pull out their swords. That's not to say the combat isn't fun, but it's certainly not polished at all.My final reason for not recommending this game comes when you look at the patch notes. It's all crash fixes. There's some new singleplayer content, some future plans. That's all well and good, but scroll through all the patch notes, and 90% of them are fixing crashes that seemingly occur for every interaction in the game. I'm not implying they shouldn't be fixing crashes, but rather pointing out a worrying trend. This game has been in development hell since it's announcement, and I doubt it's coming out of early access any time soon. I want to see this title and TW reach their full potential so badly, but I'm also a realist. This game still has YEARS to go before I'd wager I'll be able to proudly proclaim \"this product is worth $50 USD +tax\". I will be ecstatic the day I can come back to this review and update it, but for now it's a no from me.", "helpful": "176 people found this review helpful, 4 people found this review funny", "recommendation": "Not Recommended", "rewards": 19, "hrs_on_record": 67.1}, {"text": "It's passable as early access, but it needs A LOT of work in my opinion.Here is a brief list of what would make the game better overall.+ More dialogue options. Not asking for a full-blown RPG or anything here, but more than 1/2 dialogue options would be a welcome improvement.+ I noticed several visual glitches with the clothing, facial hair, etc. + Graphics NEED improvement. These visuals can be extremely ugly in places. Really needs fixed.+ Multiple game breaking bugs in different quests.+ Towns, Taverns, Castles, etc feel very dead and lifeless. Kinda reminded me of Assassins Creed 1 in terms of it's deadness. + Many MANY other more minor things.It has a good foundation of a game, but to be frank I expected a lot more out of a game that has been in development for the last 8 years.", "helpful": "608 people found this review helpful, 20 people found this review funny", "recommendation": "Recommended", "rewards": 0, "hrs_on_record": 17.4}, {"text": "(UPDATED)+pros-cons", "helpful": "176 people found this review helpful, 1 person found this review funny", "recommendation": "Recommended", "rewards": 34, "hrs_on_record": 119.7}, {"text": "Now that the honeymoon is over, i think we can be honest about the state of this game.As of June 2020, it is difficult to recommend this based on asking price.While this is a generally fun game, it is severely lacking in content.As a matter of fact, aside from the crafting system and a few changes in the way you manage your kingdom and your band, this is almost identical in content to the last game.Hell, even the dialogues are lifted from the original game.Naturally, the game does look a lot better than it's older counterparts, but after 8+ years in development, it think it is pretty much a given.Obviously, this is work in progress, and TaleWorlds has been slowly trickling down content, but considering this has been in development since at least 2012, this is very disappointing.Anyway, i'm hoping to eventually be proven wrong with this review, but for now, i can't recommend it.", "helpful": "1,489 people found this review helpful, 36 people found this review funny", "recommendation": "Not Recommended", "rewards": 166, "hrs_on_record": 20.4}, {"text": "When you purchase a product, you do not expect to get banned from multiplayer for violating chinese censorship rules. This includes having the \"incorrect\" steam ID. This affects accessibility of a game feature and hence is a relevant buy consideration.TW has made some claims to invistigate it, but so far without any further results. TW mods here on steam forums have just purged a thread (instead of at least locking it with a comment why) which called for attention regarding this censorship. Note also, the discussion there was surprisingly calm without getting overboard. I am glad to remove/change the review when this issue is settled the only possible correct way.*update 03.11.2021*Since this review, the only thing about it I can find is claim by TW that they are going to investigate it, but no further updates since, even if I employ a search on that topic again. I find stale \"updates\" like this one: Regarding the game itself:The skill leveling system is a pure grind. For some very annoying skills there is a cheese workaround in some way which is totally unimmersive, like for example to train roguary fast, you need to stage prison escapes for others over and over again. People you don't care about and don't know. Just to get the XP... Most ways of doing XP gives no xp. You can also not train fighting skills in tournaments and arena, because its reduced to almost zero. TW thinks there is only one way to play the game - as a vassal or soldier of another kingdom. Complete breakage compared to warband. Then there are skills like smithing, which are tedious and boring, the UI is terrible, but: you can craft items for the cheapest resources worth around 200 gold and sell them for around 90.000 gold at very low levels which you get to very fast.You go trade with a noble one, sell him 5 swords for all the fortune he owns and they are happy to sign the deal. Then they are in dire need of money and sell all their land for gold worth selling 9 swords...If you think its a bug, no. Its like that since the beginning and its not just one specific item. The prices for items are crazy. One sword costs 5k, another one has 1 more damage and consts 30k or 50k.With smithing you basically have infinite money EASY and FAST. You can buy all the realm and the nobles will happily sell it to you. No army needed, Just craft some ~60-90 weapons!I have no clue what the devs took to make that real and keep it like that with no changes.", "helpful": "1,782 people found this review helpful, 118 people found this review funny", "recommendation": "Not Recommended", "rewards": 5, "hrs_on_record": 228.2}, {"text": "I'm in Lockdown with my kids.I just ignored them for 4 hours straight.This game is great.Apologies.I had to disable the comments because people couldn't contain their social retardation.Or, they just cant take a joke.", "helpful": "1,050 people found this review helpful, 2,492 people found this review funny", "recommendation": "Recommended", "rewards": 6, "hrs_on_record": 62.1}, {"text": "I'm a big fan of the Total War game series especially Rome and Medieval but I always wished I could do more than just telling the troops where to go and then watching them fight, this game is one of the closest games to achieving that, allowing you to build up armies and fight battles and take part in sieges but rather than watching from afar as things unfold, you can lead from the front, riding at the front of a cavalry charge, scaling ladders to get into an enemy fort and fighting on the walls, it's great.", "helpful": "105 people found this review helpful, 2 people found this review funny", "recommendation": "Recommended", "rewards": 6, "hrs_on_record": 81.8}, {"text": "Needs more campy voice lines. I fear for the future of bannerlord memes.", "helpful": "210 people found this review helpful, 122 people found this review funny", "recommendation": "Recommended", "rewards": 0, "hrs_on_record": 36.1}, {"text": "i threw a javelin to my ruler's head in front of the entire kingdom and then they made me king 2 minutes later", "helpful": "111 people found this review helpful, 134 people found this review funny", "recommendation": "Recommended", "rewards": 14, "hrs_on_record": 178.8}, {"text": "TL;DR/ConclusionThis game is a jarring, overambitious mess, but watching your character grow from a baby into a unique leader, watching your army grow from a band of young recruits into unique and devastating fighting force that would make any man in its way pray, watching your friends and foes form and the world around you change because of it... are things I would say only this game has been able to give me, no other.As with many early access games, my relationship with this game is one of love and hate.So much of this game is stuff I've always wanted in games like this and haven't seen done well pretty much anywhere else:- Smaller scale unit tactics with more focus on the individual and the feeling of actually being there in a medieval battle- Simulated and dynamic systems like economy, logistics, morale, intuitive unit progression, even combat physics to calculate how much damage is being done by a particular weapon at a particular speed with a particular type of strike through a particular armour- RPG style skills with really creative perks and progression that very subtly and effectively makes you feel like you and your character are improving together.- Etc.Now all of the things I just mentioned, I would say put this game above many other strategy and battle sim games because they are things which increase immersion, they help put you in the shoes of your character and feel like you're playing in a living, breathing world. The strength of this game is its depth and immersion.If any of you reading this have played this game at all, you've probably noticed something very wrong with that statement.This game will CONSTANTLY rip you right out of your 'immersion' and make you very consciously aware that you're playing a video game:- The combat physics don't make any sense half the time (there's been an up to date 'Realistic Battle' mod on the nexus for the majority of this game's existence which fixes these issues, making combat far more satisfying and I'm shocked the devs still haven't addressed this).- Walking around towns and villages (which should be where immersion really shines) feels like you're walking through a ghost town, with statue npcs with terrifying expressions who don't say anything and a 'town_ambience.mp3' being played through hidden speakers in the facade houses. - Dialogue between characters may as well be non existent, with visual novel text boxes with bland writing and the most nonsensical dialogue skill checks I've possibly ever seen.- The repetitive, monotonous nature of putting your men into the same positions and the same formations at the start of every battle every 5 minutes.These things are scratching the surface of the list of things that give constant immersive whiplash while playing this game.I understand these things can come with early access titles but with this game supposedly leaving early access this year, I don't see enough of these issues being addressed, and I'm concerned that TW is running out of time and/or budget. I'm not acutely aware of how game development works but I'm slightly baffled that they seem to come out with new armours every patch, when more items is the last thing the game needs right now. I worry the loud minority of the Reddit page etc. are giving the devs a false image of what players care about. I couldn't care less if imperial armour is \"unbalanced\" or if the 'long glaive' is \"overpowered\" during game release when every npc I look at makes me feel like I'm playing a parody. Maybe I'm in the minority too but to me it really feels like the devs have their priorities mixed up and that this game will remain very much unfinished during it's 1.0 release, which is a real shame considering how much I love the unique feeling this game can give me in its strongest moments.The concept is so brilliant but as much as I want it to, I just don't think this game will ever reach its full potential.That being said, I will continue to love this game and try to contribute feedback where I can for likely years to come, and will recommend it for its strengths nonetheless.", "helpful": "94 people found this review helpful, 1 person found this review funny", "recommendation": "Recommended", "rewards": 7, "hrs_on_record": 477.5}, {"text": "Although I really love this game, I cannot recommend it. The open field battles are fun but that's pretty much the only thing this game has going for it. It's only 2 months away from its anniversary release and overall we haven't seen much improvement. There is still even small things that are broken like certain perks, smithing, item prices, .... I am sure I am missing a lot of other issues. It's a shame because this game has so much potential.", "helpful": "614 people found this review helpful, 19 people found this review funny", "recommendation": "Not Recommended", "rewards": 68, "hrs_on_record": 492.3}, {"text": "Killing looters is the real life version of fighting a fifth grader, unfair, fun, and would do again/10", "helpful": "103 people found this review helpful, 108 people found this review funny", "recommendation": "Recommended", "rewards": 8, "hrs_on_record": 217.5}, {"text": "M&B 2 is brilliant and it surpasses its predecessor in almost any manner you could care to mention. It's also really far from being finished. I've spend entire days messing with it, and I enjoyed my time with it, but I wasn't ever really doing anything I hadn't already done in Warband (apart from commanding troops with some tactical understanding beyond \"charge\", which is very welcome).Don't buy it yet. Wait another year. It's great, but it needs a lot more time in the oven.", "helpful": "267 people found this review helpful, 13 people found this review funny", "recommendation": "Recommended", "rewards": 0, "hrs_on_record": 57.6}, {"text": "Great Game, I've hardly noticed any problems, mostly just typos. Really wish there was a way to do co-op campaigns where your friends replace your companions in your armies. i would honestly pay just as much as i did for the game for a multiplayer expansion like that. great rpg with a unique twist of controlling your own kingdoms if you work for it!", "helpful": "129 people found this review helpful, 2 people found this review funny", "recommendation": "Recommended", "rewards": 0, "hrs_on_record": 53.7}, {"text": "Love the game, BUT...Has serious lag issues with menus, which never used to be there. So every menu it stutters for 5/10 seconds (on an SSD) pretty sure its having a major problem with loading the thumbnails for items and units. So every time you wanna trade, lag, every time you take prisoners, lag, every time you wanna upgrade your troops, lag.May seem small but having this constantly with every menu you open gets seriously annoying. Id say get it because its great, and the mods will be unbelievable, but wait until they fix this damn stuttering.Also dear Devs, literally no one cares about MP, thats not what your fanbase is, so stop updating that rubbish and focus purely on the core game, cheers.", "helpful": "184 people found this review helpful, 3 people found this review funny", "recommendation": "Recommended", "rewards": 14, "hrs_on_record": 470.2}, {"text": "In my now 23 hours of gameplay in the Bannerlord, of which 90% has been spent in shackles or under siege. I can safely say I am yet to experience the game. I don't really know why but it feels like I am getting worse at video games, so having a Singleplayer game like this one is nice since the only ones who laugh at me are the AI soldiers next to my corpse. I am yet to find a woman that wants me, and every Kingdom I join is destroyed within 45 minutes of gameplay. The Lords have so far bullied me into poverty through elitist laws causing me to have no influence or fiefs. I shouldn't like this game but everytime I see it in my library I have this sudden urge to raid mongol villages. The forest people are pretty bad too. Today I will try to play the main quest which I have avoided in fear of losing that too.", "helpful": "126 people found this review helpful, 267 people found this review funny", "recommendation": "Recommended", "rewards": 0, "hrs_on_record": 35.7}, {"text": "~ DIFFICULTY ~🔲 My 90 year old grandma could play it🔲 Easy☑️ Normal☑️ Hard🔲 Very Hard🔲 Dark Souls~ GRAPHICS ~🔲 MS Paint🔲 Bad🔲 Meh🔲 Graphics don't matter in this game🔲 Not good, not bad☑️ Good🔲 Beautiful🔲 Masterpiece~ MUSIC ~🔲 Bad🔲 Not special☑️ Good🔲 Beautiful~ STORY ~🔲 This game has no story🔲 Like playing Temple Runners for the story☑️ It's there for the people who want it🔲 Well written🔲 Epic story~ REQUIREMENTS ~🔲 You can run it on a microwave☑️ Average🔲 High end🔲 NASA computer~ LENGTH ~🔲 Very Short (0 - 3 hours)🔲 Short (3 - 15 hours)🔲 Average (15-50 hours)🔲 Long (50-90 hours)🔲 Extremely long (90-110 hours)☑️ super long (110+ hours)🔲 No ending~ FUN ~🔲 I'd rather watch paint dry🔲 Hard to enjoy🔲 Repetitive☑️ Actually pretty amusing🔲 Ride of your life~ BUGS ~🔲 Never heard of☑️ Minor bugs🔲 Can get annoying🔲 ARK: Survival Evolved🔲 The game itself is a big terrarium for bugs~ REPLAYABILITY~🔲 It's a one-time experience🔲 Only for achievements🔲 If you wait a few months/years🔲 Definitely☑️ Infinitely replayable~ WORTH BUYING ~🔲 No☑️ Wait for sale🔲 Yes", "helpful": "304 people found this review helpful, 24 people found this review funny", "recommendation": "Recommended", "rewards": 42, "hrs_on_record": 384.3}, {"text": "Normally i would refrain from making any reviews, especially early access.But, this is a special one.Other reviews have mentioned the pros and cons. But, none of them have mentioned that for the last 10 days (by the time i am writing this), the game have updated 10 times, even on the weekends as i remember (which i am very much surprised). Which means, this is much much better than any early access out there.While this means that mods are not stable just yet, this does mean that the devs are actually really paying attention to their game and not making plans for other endeavors such as microtransactions or obscure DLCs.Don't buy if you want minimal bugs. Buy if you want to support the game and the devs.", "helpful": "116 people found this review helpful, 10 people found this review funny", "recommendation": "Recommended", "rewards": 0, "hrs_on_record": 81.3}, {"text": "They don't make 'em like this any more, kids!I played the first M&B the month it came out in early access (anyone else remember the Zendar arena?). I was 13 years old and I can still remember the sheer sense of wonder as I stepped out into a basically-empty map, with only two factions and PS2-era graphics. Development was slow, but it was well worth the wait. The dev team were incredible, talking one to one with their playerbase and dedicating years to a game which, for all they knew, might go nowhere.Now Bannerlord has brought the series into the modern era. No, it isn't the finished, polished product yet. Then again, neither was M&B1, or Warband, or really anything in the M&B series so far. The joy of these games is that despite feeling cobbled together and a bit makeshift, they still offer 10x the depth and variety of many triple-A titles. Well worth the wait (and there will be plenty more waiting, trust me) and well worth supporting one of the most long-term dedicated dev teams this side of Dwarf Fortress.", "helpful": "171 people found this review helpful, 5 people found this review funny", "recommendation": "Recommended", "rewards": 27, "hrs_on_record": 181.9}, {"text": "An absolutely awesome game that's highly engrossing and a lot of fun ^^ However, at the time of writing this, the game is very early access. Due to the popularity of the previous game and the demand for this game, they may have released it a lot earlier than most people would have liked. Although the devs seem to listen to suggestions, and are steadily improving a lot of aspects with regular updates, which may make the game better than if they waited until it was more finished before releasing it :)Single player is so much fun with so many different ways to play it.Become a merchant, a mercenary, a smuggler, a blacksmith, a lord/lady or even a King or Queen of a Kingdom. You can also lead or fight in armies/sieges, manage castles and cities, get married, have kids. There are 6 races you can play as with different perks, you can customise your male or female character then chose what life they had which affect your starting out skill levels.There are different difficulty levels. If you haven't played the previous game, I recommend starting out on very easy then when you get the hang of it, go to realistic. You also can't play this like the previous game, seen people who tried with hilarious results. One Warband player went charging into some cavalry, was killed in one hit and his dead body rag dolled off his horses xD Like in Kingdom Come Deliverance, you start the game off as a peasant and feel like a peasant.You also have an option to have lords perma die or not die. There are pros and cons to having it on or off. If it is on and you die in battle, like with the npc lords and ladies, there's a chance you be captured and a chance you will stay dead. If you do die and you have married and had a child, then you can carry on playing as as the child. (Currently a child takes 1,512 days to grow up to an 18 year old. A day not sped up takes 1 min 36 secs but if quickly waiting a day will take 10 seconds. There's 4 months in a year. So a child will take between 40.32 hrs to 4.2 hrs real time to grow up atm/time of posting this.)When you start the game you create a clan which is your family and any one you have hired. When you get your clan level high enough, you can create your own kingdom (if you haven't joined an npc kingdom). Then you are essentially a King or Queen and can persuade/charm enemy clan leaders into becoming your vassals. Unless you have a dynasty of grown up children, you need vassals if you strive for world domination. Also with other lords/ladies you can use influence to create armies and have huge battles. Huge battles are fun, feels a bit like a Total war game but played from a first person perspective as a peasant/mercenary, lord or general.Multiplayer is fun but the vast majority of the people in it have possibly played the game for hundreds of hours. In multiplayer there is a captain mode where you strategically command troops and there is a 60 vs 60 siege battle of only real life players which is awesome. 60 vs 60 siege is so cool, you have real life players pushing the rams, managing the ballistas, throwing boulders at the invading forces, sometimes you might even see players holding their shield up to protect other players on their team. While I definitely recommend the game and while it is playable, it does have a long way to go.The vast majority of the negative reviews seem to be people who haven't got a good pc or were expecting a more finished, bug free and optimised game. So I suggest you look in the discussions and news for updates before deciding when you want to buy it.Also about the multiplayer Anti cheat: The anti cheat is Battleye, I like that there's an anti cheat and that its not useless Denuvo, but I've avoided installing Battleye when playing Ark Survival Evoled. Its a highly invasive and from researching it, a minority of cases have had malicious problems since installing it. But because most players don't have a noticeable problem, people think its safe. I'm just not sure if it is actually safe (just highly invasive) or if it is smartly malicious, either way don't really want it on my computer. So will uninstall it when I'm not playing on multiplayer. Would kinda prefer For Honors/Vermintides 2's Easy Anti cheat as it's less invasive and processor hungry while being highly effective", "helpful": "106 people found this review helpful, 6 people found this review funny", "recommendation": "Recommended", "rewards": 14, "hrs_on_record": 46.5}, {"text": "Steam game review chart v2---{Gameplay}---🔳Try not to get addicted☑️Very good🔳Good🔳Nothing special🔳Ehh🔳Bad🔳Just dont---{Graphics}---🔳Masterpiece☑️Beautiful🔳Good🔳Decent🔳Will do🔳Bad🔳Awful🔳Paint.exe---{Audio}---🔳Eargasm🔳Very good🔳Good☑️Decent🔳Not too bad🔳Bad🔳Earrape---{Audience}---🔳Kids🔳Teens☑️Adults🔳Everyone---{PC Requirements}---🔳Check if you can run paint🔳Potato🔳Decent☑️Fast🔳Rich boi🔳Ask NASA if they have a spare computer---{Story}---🔳Doesn't have🔳Something isnt nothing I guess☑️Not greatly told🔳Average🔳Good🔳Lovely🔳Will make you cry or smile alot---{Playstyle}---☑️Almost never the same in any two people🔳varies a little bit from person to person🔳Weapon AND character classes🔳Weapon OR character classes🔳Creative AND Survival🔳Creative OR Survival🔳Melee AND Ranged🔳Melee OR Ranged---{Difficulity}---🔳Just press a bunch of buttons🔳Easy🔳Significant brain usage☑️Easy to learn / Hard to master🔳Not so easy🔳Difficult🔳Dark Souls---{Grind}---🔳Nothing🔳Only if you care about leaderboards/ranks🔳Isnt necessary to progress☑️A bit grindy sometimes🔳Average grind level🔳A bit grindy🔳Insanity---{Game Time}---🔳Long enough for a cup of tea🔳Short🔳Average🔳Long☑️Depends on you🔳Endless---{Price}---🔳Just buy it🔳Worth the price☑️Wait for sale🔳Maybe if you have some spare money left🔳Not recommended🔳Dont throw money into a rubbish bin---{Micro-Transactions}---🔳EA🔳Mobile Game(Necessary if you don’t want to wait 15 weeks to construct a toaster)🔳”Premium” Currency AND Normal Currency🔳”Premium” Currency OR Normal Currency🔳Quick way to advance🔳Fortnite(Skins/Emotes/Etc)🔳Only to show off big time🔳Level DLC☑️None---{Bugs/Glitches}---🔳Never had any🔳Minor bugs/glitches☑️Few bugs/glitches🔳Can get annoying🔳Ruining the game🔳The game itself is a big terrarium for bugs/glitches", "helpful": "321 people found this review helpful, 53 people found this review funny", "recommendation": "Recommended", "rewards": 32, "hrs_on_record": 90.5}, {"text": "Never played Warband, but this is one of the best 'war' game i've ever played even though it's still in early access, there are so much things to do. Now that the modding tools are here, can't imagine the things those creative modders will do. Hoping they'll make Game of Thrones and Lord of the Rings mods!", "helpful": "88 people found this review helpful, 4 people found this review funny", "recommendation": "Recommended", "rewards": 9, "hrs_on_record": 530.1}, {"text": "I am very picky about the games I purchase, but this is a great game.I was very skeptical, it is early access, I read negative reviews on steam, watched review from Angry Joe Show by Rapidfire and decided not to buy. But then I watched a Let's Play on youtube, and thought it looked awesome. That was the deciding factor because I got a nice and easy intro to the game and how it works. I bought it thinking I could just return it if I didn't like it.The next thing that happened was that I played non-stop for 2 days, I didn't feel a bit sleepy at all, that is extremely rare for me.Apparently there are some missing features, main quest is a bit vague and stops at some point, obviously because the game isn't finished yet. Some talents doesn't work at all or not like they should, but community mods have fixed this.FPS drops drastically sometimes during big siege battles, depends on where you are and what you are looking at.When you die you can fast forward the rest of the battle, when it is a big battle and FPS drops, the seconds goes by slower sadly.A bug happened to me during a siege, there was 1 enemy that managed to bug itself high up on a wall, and none of my units were able to kill the last enemy, resulting in an endless battle, because for some reason you have to kill every single enemy to win. So we were about 40 units trying to kill the last guy, I managed to find some arrows outside the castle and kill him.Another time I died and let the battle continue to see if we won or not. But again there was an enemy that bugged itself so it turned into an endless battle. I had to select \"retreat\", lose units because we retreated, and then send in units afterwards to kill that 1 guy, and somehow manage to lose a few units again.There is also this mini-game where you have to convince someone to marry you, if you fail 1 time on any of the questions (percentage chance) then you will never ever be able to marry that one npc. You can save and load to repeat, but it becomes tedious. Maybe you can increase your standing with this NPC by doing quests or gifting stuff, but not everyone has quests available or very rarely, and gifting takes time.But I still recommend this, because over 90% of the time I've had an awesome time playing this game.Also, the game has never crashed for me.", "helpful": "132 people found this review helpful, 18 people found this review funny", "recommendation": "Recommended", "rewards": 0, "hrs_on_record": 65.7}, {"text": "So Warband is probably my all time favorite game and do it is with a pretty heavy heart I write this review. Ultimately, Bannerlord has the basis for a good game, but not only is the game unfinished and unbalanced it's chopped full of cool features executed so horribly it'd be better off without them. It's also worth noting part of what prompted me not reccomending is the rate at which patches come out. Currently they seem to be focusing on fixing crashes, which with as much in the game doesn't work and hasn't for years seems kind of ridiculous to focus on. Below are a list of major issues within the game I'll do my best to remove them if they get fixed.Siege AI- So I'll start with the battlefield AI. It's been almost 2 years and we don't have a AI that climbs ladders something necessary to win siege assaults. I'm not kidding I defended a castle with 400 against over 2000 and won without losing more than 100 soldiers simply because the AI can't climb ladders. Even worse if you bust the gate your soldiers will actively ignore the breached gate for siege towers/ladders they blatantly don't know how to use. So 2 years after release sieges are essentially broken unless controlled by the player, ya know something absolutely integral to the game?Siege extended- Also on the strategic map instead of being a resonable human being building your equipment en masse and sending it up the second a ranged engine is built it engages the castle meaning you will pretty much never have 4 onagers as the offence, in fact the only purpose of ranged engines is to either get 1 to assist you in an assault or to spam trebuchets to breach the wall so you can just tell your soldiers to charge and them actually do it competentlyStrategic AI- The strategic AI is at least workable, but actively uses a us vs player mentality, which once again sucks the fun out of the game. Lets start with there's no non aggressions pacts, alliances, ext., which the game desparately needs. The AI will actively gang up on the player in 3 vs 1 scenarios and if the player declares war on someone who is already at war they will instantly get peace and both declare war on player. If the AI ganging up one you is not bad enough your own lords will attempt to start wars while you are in multiple conflicts as is, this is a major problem because is means you either throw away massive amounts of influence to keep peace or let your lords drive your nation into the ground with suicidal diplomacy. Furthermore, if all this wasn't enough what is peace really worth? It's not uncommon for factions to declare war less than a week after peace is achieved making the whole tribute system pointless. On a side note the AI is absolutely tunnel visioned it will do whatever it takes to achieve whatever petty objective it sets it mind to. I had the AI forming multiple 1000 man armies to raid a singular village I ended up killing over 5,000 soldiers before they ultimately raided the village. There was a point where i was waiting in it and there were at least a half dozen lords just circling around the village waiting for me to leave. This is just 1 small example of how the AI's tunnel vision breaks immersion where it becomes blatantly obvious the AI is more interested in harassing the player than acting like a actual lord.Mercenaries- Mercenaries are another should be cool feature that is executed so poorly it ruins the game. There are 14 mercenary clans in the game each with 4 lords each (meaning 56 lords in total). During wars nations can recruit these clans for a sum of money based on performance during the conflict. The problem is as a player you must hunt down the mercenary leader and he can't be hired by another nation at that time to recruit them, which you almost never have time to do during a war. Even worse he is on a timer you don't know about and will auto defect to another nation and be unretrievable at that point (and usually find his way to working for your opponents rather quickly. In contrast the AI auto recruits mercs based on how the war is going and realistically doesn't have to worry about paying them because if you're winning they aren't really getting paid. It's so bad before I started genociding them  it wouldn't be uncommon for any nation I warred with to have 10-12 merc clans thats 40+ merc lords more than i have in total. In all honestly the only way to play the game because of this is to capture all of each merc group and execute them, which makes you dishonorable and hated by literally everyone, but its better than every nation in the game essentially have 40 extra lords to fight you, which is what occurs. There desparately needs to be a streamlined way to hire lords as the player and limit on the number a faction can hire (like 2).Bandits-Simply put as the game goes on bandits become too abundant and the player is the only 1 who will target hideouts meaning eventually they simply respawn faster than you can stomp them out.Finances- So finances are weird in Bannerlord you will lose money supporting garrisons for your fiefs, but forging a 2h sword is worth like 50k and you can forge more multiple of these in a day meaning being a blacksmith is more lucrative than a lord? Tournament betting is limited and rarely offers a good item, but they are happening is almost every city 24/7 so you have constant access. Raiding offers very little money (which makes it stupid for the AI to be so obssessed with doing it), but beating armies offers a trove of loot and gold. Overall I feel like being a lord should be more rewarding. I also don't like that your fiefs auto recruit garrison, which you pay for and the game should be less about beating up enemy lords so you can make rent each day, which is just nonsensical. Quests-This leads me to my next one that quests are so limited. This is largely due to most quests having a requirement that results in notables spamming quests to you. For instance if a village is under 200 prosperity it will request tools, which results in that village requesting tools like 5 times in a row before their prosperity gets somewhere decent. Also it results in some fun quests being virtually non existent I have only gotten help raise a noble's son ONE time in 340 hours. I have seen capture enemy lord maybe twice? Even worse once you are tier 6 most people will say oh this quest is beneath you even though it could be negatively affecting for fief each day it goes unfinished. Even worse several Warband quests such as bounty hunting are just absent.Game Pacing & Recruitment- Finally the last reason I can't reccomend Bannerlord is the pacing . The problem is that notables replenish too quickly. Combined with the fact the enemy always respawns with ~30 soldiers and will escape from any prison in ~1 week means that you never really feel like you're making a impact against the enemy. Yes their 1st wave is always the toughest, but after that they never lose the ability to launch 1k army assaults back to back to back. It degrades a otherwise interesting combat system to being utterly meaningless. It also means that ransoming, releasing, or holding onto a lord has very little effect with the only noticable decision being to kill them, but once again everyone hates your for it.", "helpful": "90 people found this review helpful, 2 people found this review funny", "recommendation": "Not Recommended", "rewards": 11, "hrs_on_record": 343.6}, {"text": "I love Bannerlord, but can not recommend it in its current state. When I bought the game on its release, I really enjoyed playing it and was excited to see what the devs would do with the game. I have now revisited the game though, and am fairly disappointed with the progress of its development. I am happy that the developers have fine tuned many of the game mechanics and fixed many of its numerous bugs, but feel that this is really the only thing that they have completed. The devs have still not implemented many vital features, such as perks effects. Currently, most perks don't work; out of the 12 perk trees that exist, 5 of them contain perks whose effects don't work, and another 3 have less than 20% of their perks working. Other missing features include some mechanics regarding sieges, kingdom management, and crafting. There has also been very little in the way of any new armors or weapons, which would not be a problem if modding tools were released. However, mod support has yet to be released, and its modding community has subsequently died. My overall opinion is that the game has been released for 5 ½ months, and in that time, has made little significant progress in the way of attracting its player base back. I would recommend that anybody who is on the fence about purchasing the game wait until mod support drops.Edit: If anybody wants to see what perks are and aren't working, check this: Also, the devs officially announced that the first batch of modding tools is planned for release by the end of August: 2nd Edit: Its September 10th, almost a month later, and they have not released modding tools yet. Like I said, progress with the game's development is disappointing.", "helpful": "403 people found this review helpful, 12 people found this review funny", "recommendation": "Not Recommended", "rewards": 28, "hrs_on_record": 182.5}, {"text": "Ah yes, Bannerlord.More than a year ago, the first glimpse of releasing the game to EA, to be actually playable, after years and years of teasing, was a great moment for this game. People flocked to the early access chance in huge numbers, I mean, EVERYONE boarded the hype train, and ♥♥♥♥♥♥♥♥♥, what a hype train it was. New Youtubers were born just thanks to the EA release.The game received enormous amount of support, praising the new visuals, the new game engine and overall look. It was an instant hit on Steam.Then, the Warband community stepped in and showed the issues the game had, outlined the perks and mechanics that are not working, and the overall lack of content in the game, outside of gathering troops and swinging swords.I thought to myself - They must be wrong, the game is good, it is exactly what I expected, swinging swords, leading troops, winning battles. Tens of hours later (and months and months IRL time later after EA), the realization kicked in - they are right. After the novelty of the new eye catching game engine wears off, this game just has nothing to offer.Modding support is great for any game. It keeps it alive for years to come - just look at Cities Skylines. The modding community has kept the game alive all these years after the initial release, and if one would run the numbers, it still generates hefty income on sales - YEARS after release.Why am I mentioning modding support, you'd ask?Well, it is quite simple - it is acceptable for the game to be extended with great mods after initial release, it's just there is this elephant in the room that started to grow as soon as Bannerlod hit the EA - if you step back and look at this game, nothing has changed within the game itself and it has been on life support from modding community - WHILE STILL BEING IN EARLY ACCESS.- Balance fixes- AI fixesThese two points can describe the year Bannerlord has spent in EA. No mechanics have been added to the game.How is it possible for a game to not change that much after a year in EA, while modding community can churn out fixes for the problems the game has faster than developers can?How come, the community can create and release new mechanics for the game, while the developers have not even mentioned a single thing that is coming?The Early Access title has become a badge of shame for Bannerlord.It is a fun game for the initial hours of gameplay, dont get me wrong, but it has nothing more to offer once the initial novelty wears off, and the non-existant roadmap or anything in that regard does not help much.I don't know what to recommend you guys - if you want couple of hours of fun, sure, buy it, but remember that in that way, you are supporting the ongoing problem with this game, hence I am leaving a thumbs down for this.", "helpful": "559 people found this review helpful, 15 people found this review funny", "recommendation": "Not Recommended", "rewards": 52, "hrs_on_record": 135.2}, {"text": "My overall impression is possitive but that doesn't mean there are not a lot of issues with the game.Game is fun, uniqe and has a very well built combat system. Those are solid wins for the game so it gets a thumbs up. Sadly, after more than a year of 'early access' my expectations are kinda let down. Needs a lot more features and a good amounth of bug fixes.If you like this type of game buy it, it has a lot of potential. But don't expect a perfect product.", "helpful": "72 people found this review helpful, 2 people found this review funny", "recommendation": "Recommended", "rewards": 1, "hrs_on_record": 88.1}, {"text": "---{Gameplay}---☑️ Try not to get addicted☐ Very good☐ Good☐ Average☐ Nothing special☐ Ehh☐ Bad☐ Just don't---{Story}---☐ Will make you cry or smile a lot☐ Lovely☐ Good☐ Average☐ Nothing Special☐ Ehh☐ Bad☐ Awful☑️ What?---{Graphics}---☐ You forget reality☐ Masterpiece☑️ Beautiful☐ Good☐ Decent☐ Will do☐ Bad☐ Awful☐ Paint.exe---{Audio}---☐ Eargasm☐ Very good☑️ Good☐ Decent☐ Not too bad☐ Bad☐ Earrape---{Difficulity}---☐ Just press a bunch of buttons☐ Easy☐ Not so easy☑️ Easy to Learn / Hard to Master☐ Significant brain usage☐ Difficult☐ Dark Souls---{Grind}---☐ Nothing☐ Only if you care about leaderboards/ranks☐ Isn't necessary to progress☐ A bit grindy sometimes☑️ Average grind level☐ A bit grindy☐ Insanity---{Game Time}---☐ Long enough for a cup of tea☐ Short☐ Average☐ Long☐ Depends on you☑️ Endless---{Bugs}---☐ Never had any☐ Minor bugs☐ Few bugs☑️ Can get annoying☐ Ruining the game☐ The game itself is a big terrarium for bugs---{Audience}---☐ Kids☐ Teens☐ Adults☑️ Everyone---{PC Requirements}---☐ Check if you can run paint☐ Potato☑️ Decent☐ Fast☐ Rich boi☐ Ask NASA if they have a spare computer---{Price}---☐ Just buy it☑️ Worth the price☐ Wait for sale☐ Maybe if you have some spare money left☐ Not recommended☐ Don't throw money into a rubbish bin", "helpful": "718 people found this review helpful, 149 people found this review funny", "recommendation": "Recommended", "rewards": 0, "hrs_on_record": 339.3}, {"text": "wish it had co op so friends could have a joint realm or aliance and maybe even a rivalry", "helpful": "145 people found this review helpful, 4 people found this review funny", "recommendation": "Recommended", "rewards": 17, "hrs_on_record": 226.6}, {"text": "its not finished but its still great. battles are EPIC", "helpful": "72 people found this review helpful, 1 person found this review funny", "recommendation": "Recommended", "rewards": 1, "hrs_on_record": 651.3}, {"text": "Now we wait for the Star Wars Mod(s)", "helpful": "183 people found this review helpful, 44 people found this review funny", "recommendation": "Recommended", "rewards": 6, "hrs_on_record": 10.6}, {"text": "Congratulations people! You have survived long enough to see the release of this game! Now may you also survive through this coronavirus to play this game for years to come!", "helpful": "1,490 people found this review helpful, 966 people found this review funny", "recommendation": "Recommended", "rewards": 0, "hrs_on_record": 44.8}, {"text": "Thank you Taleworlds for giving us a chance to play this game before coronavirus wipes us all.", "helpful": "3,299 people found this review helpful, 3,495 people found this review funny", "recommendation": "Recommended", "rewards": 3, "hrs_on_record": 528.0}, {"text": "For anybody looking to buy this game, I'd say to wait until considerable improvements are made on it's development. Having said that, I very much enjoy some aspects of this game and have sunk a fair amount of hours into it when I've been in the mood to play it.Sieges are completely broken, in my opinion. You cannot order your men around efficiently at all without delegating command to the ai. Troops will crowd around the bottom of siege towers and not use ladders. They also wait in large blobs getting picked off until the last minute before getting to the ladders. Then when they actually do go up ladders they do so as slowly as possible, one at a time. Not very fun watching your party of men that you spent hours training up fighting looter parties getting picked off one by one by peasant archers due to their own stupidity. This problem has been persistent since release and a major reason why I choose to auto resolve all sieges. Yet the devs spend too much time re-balancing items and perks and updating sheep models and textures that no one cares about.Battles can be very frustrating, particularly in villages due to the fact you spawn less than 100 metres away from the enemy and don't have any time to get into formation. You should at least have pre-deployment options like in total war for example. Large battles are utterly ridiculous. Say you are winning a 1000 vs 1000 battle and you push back the enemy, they will constantly spawn on you and it just turns into a complete brawl with disregard to formation or tactics. Not very good if you are not in command (i.e. in an army). I don't see why you cant end the battle after the first 'wave' and fight large battles in stages just like in M&B Warband, for example. Aside from the known pathfinding issues, the ai is questionable at times in one on one fights i.e. standing still and staring at each other for a few seconds doing nothing.Ordering troops can be very clumsy. I feel like a 'command mode' that allows you to place your troops using the mouse while you stay back (as any good commander should!) would be beneficial. You should also be able to order your troops to skirmish, protect flanks, volley fire, spear brace etc. as seen in mods in the previous instalment, M&B Warband. When you tell archers to advance they seem to run right up to the enemy at sword striking range without firing and immediately running away somewhere you don't want them to, instead of skirmishing properly. Cavalry are almost impossible to control properly without delegating to the ai and may charge into spearman against your will.For a game that I (and every other fan) have been waiting 8 years to play, I feel somewhat disapointed. Even though I have fun playing the game, after 30 mins of playing the game my immersion is broken in some way, therefore, I wouldn't recommend for new players until the game is out of early access. If this had been released in 2016 or even 2018 when they had released videos of a seemingly functional game, I would have said different, but 8 years for what we have got here is ridiculous.", "helpful": "384 people found this review helpful, 11 people found this review funny", "recommendation": "Not Recommended", "rewards": 33, "hrs_on_record": 304.6}, {"text": "Bannerlord was estimated to be in early access for 1 year. We're now approaching the 2nd year mark of early access. Bannerlord is not bad game or one that I wouldn't recommend. The devs on the other hand have entirely lost sight of the project. The devs think they are some kind of super mega company super stars that can just ignore their fans. The siege AI has been broken for ♥♥♥♥♥♥♥ ages and the devs haven't even bothered to acknowledge the problem exists instead they put out much more meaningful updates such being able to raise your fist in MP now. I'm sure all 2 people that are still active in MP liked that update. Since the start of the game the devs have been adding new towns, cities and castles which do look very good, but what is the point if the game is so shallow there is literally no point in going to these places? Hey look guys, the devs have added 2 new taverns for Dickburg and Pisstadia along with bug fixes in a 9 gb update. How many times will you actually go to these taverns? Never, there is no point in exploring anywhere in this game. NPCs just repeat the exact same 3 lines, your dialogue choices don't matter. It's actually laughable if you order a drink from a waitress through dialogue nothing even happens she just walks away but oooo you can play the exact same boardgame in every tavern. Such an immersive experience indeed. The devs think they can turn this game into an E-sport. Well to that I need to remind them that E-sports needs not only an audience but also players which Bannerlord multiplayer has neither. The drive of Mount and Blade has always been the singleplayer and its sandbox do whatever you want experience not multiplayer which the devs pile more and more resources into while singleplayer sits there a shallow repetitive broken bore. Now back when I mentioned the length of this game being in early access, It wouldn't be a big deal that the game stayed in early access longer than intended, delays happen and with covid keeping that efficiency would no doubt be hard. The problem that I have with the devs keeping the game in early access is because the updates they put out are so ♥♥♥♥♥♥♥ empty, at the rate of progression maybe if you revisit this game in 3 years it may just about be ready to leave early access. THEY DON'T EVEN HAVE BANNERS IN THE GAME CALLED ♥♥♥♥♥♥♥ BANNERLORD YET. TaleWorlds, you don't need to put out a new update every single time you add 1 tiny ♥♥♥♥♥♥♥ thing, save those features and cobble them together with massive game changing updates to make it actually exciting. No one is going to get back into the game because I can now upgrade my party members to lords, nobody gives a ♥♥♥♥ about that on its own or any of the other ♥♥♥♥♥ minor feature you add. Devs really need to get their finger out their ass and actually work on their game and allocate their resources back into singleplayer. I love the game, but my patience with the devs since release has been tested time and time again, €50 for this is just a joke.", "helpful": "105 people found this review helpful, 4 people found this review funny", "recommendation": "Not Recommended", "rewards": 15, "hrs_on_record": 104.0}, {"text": "Bear with me, this is a doozy, and may be the only steam review I ever actually write. I had astronomical hopes for this game... I played Warband religiously for years, accumulating hundreds upon hundreds of hours. It was my go-to and I have many, many fond memories from my childhood playing that game. It's among my all-time favorites. I was there when Bannerlord was announced, I diligently checked for and read new dev diaries. I remember when each faction, each new mechanic was announced. I followed this game's development for the entire long slog. I remember when the EA was announced, to the cheers of \"It's almost harvesting season!\" from the fanbase. I was ready to forgive just about any goof or gaff that Tale Worlds committed all for the chance to play the game that I had waited literally my entire middle school/high school/most of college life. I didn't buy at first (I did not have a good enough computer and I was troubled by some preliminary responses. Finally, I got it. I've played it for over one hundred hours now. It has so much that I loved from Warband, and I HAVE had some tremendous fun playing at times.However, here I am leaving a negative review. I waited eight long years for this game, with an additional 10 months or so of EA development, and the game is STILL noticeably unfinished. The factions are still atrociously unbalanced (plz fix the Khuzaits, they are still monstrously OP even after your 1.5.7 beta nerf). The companions have taken a large step down even from Warband, basically sacrificing any semblance of personality in exchange for sheer number of available companions. The AI still has no idea how to conduct anything resembling effective diplomacy (forgivable in 2010, but 100% inexcusable in the modern era of EXCELLENT grand strategy games. The technology is absolutely there). Factions declare idiotic wars they could never win and then refuse to make peace even when attacked by multiple factions at once. The tribute system is indecipherable, there are still potentially campaign-ending bugs, snowballing is still a huge issue, and executions are useless because the AI never uses them (in my experience) and the consequences for the player executing a lord are so steep that you basically have to commit your entire playthrough as a borderline genocide run, because your relation with a TON of clans (many of them random-ass clans from across Calradia that should not be batting an eye at this) will be irreparably ruined. The AI certainly has no concept of how to actually fight a battle, forcing you to either always have a massive party to outnumber your enemy (impossible because of party size limits and the relatively steep influence cost it takes to form and maintain a large army) or micromanage the crap out of every soldier you have, in real time, while also trying to actually have fun and fight/not instantly die. They've gotten rid of almost all passive experience gain, so the only way to upgrade troops is by grinding out boring battles with looters (who, as a further slap in the face, seem to always kill exactly one of your top tier troops in the process because the battle simulation sucks ass. And because top tier \"noble\" troops are so hard to find in the first place, let alone upgrade for the reasons previously listed, I hope you enjoyed having that elite cataphract for all of two days). They haven't even implemented all the perks for the skill tree yet, after all this time. I say all this to say that I'm very disappointed, even frustrated, with how this game was developed so far. I don't mean this to be personal because I know that Tale Worlds has, to their massive credit, been working hard at patching out bugs and rebalancing things as best as they can, when they could have just taken the money and run. I'm just left scratching my head wondering why this game, the one we have currently, took so long based on what's there.Take this review as more of a caution against the EA game in its current state. Let me be clear, the bones for a tremendous game are there, I promise. Like I said, I did have plenty of fun with this game despite its issues. I've just reached a point at which I can no longer ignore them, and they are a bit too glaring for me to continue having fun with this game for the time being. I'll be taking a break for a while. For those of you considering buying at this point: wait. Watch for hotfixes, patches, and updates. Read the forums and see how things seem to be progressing. Hold off until this games reaches its full release, at the very least. Devs, you haven't lost me yet, but my trust in you has been strained. Please, please, iron things out, and I will be back to dumping my hours into this game like I'm a 12 year old playing Warband again. I will promptly delete or otherwise edit this review when that time comes.For now, I will sit tight. Harvesting season eludes me still.", "helpful": "109 people found this review helpful, 4 people found this review funny", "recommendation": "Not Recommended", "rewards": 15, "hrs_on_record": 166.4}, {"text": "This game is hard for me to rate. After years of early access, it is still a buggy unfinished mess. Development is extremely slow. Feels like it is being done by one guy in his spare time. A lot of effort seems to be put into balancing multiplayer, despite core features not even being implemented or polished yet, leaving balance changes pointless and quickly obsolete anyway. Each new update also seems to bring new bugs with it, that linger for months without fixes. The new \"story mode\" is extremely simple, and only add annoyances to the gameplay. At its core, the game is just the same game that they have released several times already, just with a new coat of paint...But the gameplay. It just works. And it is damn addictive, just like the previous games. I can easily get lost for weeks, just playing around in the sandbox singleplayer world. Playing around with different builds. Combining different troops and tactics. Joining and taking over different factions.If you are thinking of buying it, maybe wait for a sale. Or pick up \"Mount and Blade: Warband\" for a bargain, try it out for a bit. If you like it, you will like this game too. Like I said, it is essentially the same game, with a few new features and graphics. And be ready to having to use mods to unlock the full potential. Spare time modders will often fix things in days, which takes the official devs months or years. At this point I kinda hope the devs just completely stop developing the game, so it won't keep breaking mods for pointless tiny updates. And so modders could get on with more ambitious mods and conversions, like we had with Warband.It is an aquired taste. If the core gameplay clicks with you, you can easily get over the mountains of jank and unfinished stuff, and the work/effort required for installing mods.", "helpful": "77 people found this review helpful", "recommendation": "Recommended", "rewards": 7, "hrs_on_record": 424.9}, {"text": "---{Graphics}---☐ You forget what reality is☐ Beautiful☐ Good☑ Decent☐ Bad☐ Don‘t look too long at it☐ MS-DOS---{Gameplay}---☐ Very good☑ Good☐ It‘s just gameplay☐ Mehh☐ Watch paint dry instead☐ Just don't---{Audio}---☐ Eargasm☐ Very good☑ Good☐ Not too bad☐ Bad☐ I'm now deaf---{Audience}---☐ Kids☑ Teens☑ Adults☐ All---{PC Requirements}---☐ Check if you can run paint☐ Potato☑ Decent☐ Fast☐ Rich boi☐ Ask NASA if they have a spare computer---{Difficulity}---☐Just press 'W'☐ Easy☑ Significant brain usage☐ Easy to learn / Hard to master☐ Difficult☐ Dark Souls---{Grind}---☐ Nothing to grind☐ Only if u care about leaderboards/ranks☐ Isnt necessary to progress☑ Average grind level☐ Too much grind☐ You‘ll need a second live for grinding---{Story}---☐ No Story☑ Some lore☐Average☐ Good☐ Lovely☐ It‘ll replace your life---{Game Time}---☐ Long enough for a cup of coffee☐ Short☐ Average☐ Long☑To infinity and beyond---{Price}---☐ It’s free!☐ Worth the price☑ If it's on sale☐ If u have some spare money left☐ Not recommended☐ You could also just burn your money---{Bugs}---☐ Never heard of☐Minor bugs☑ Can get annoying☐ ARK: Survival Evolved☐ The game itself is a big terrarium for bugs---{?/10}---☐1☐2☐3☐4☐5☐6☑7☐8☐9☐10", "helpful": "409 people found this review helpful, 82 people found this review funny", "recommendation": "Recommended", "rewards": 45, "hrs_on_record": 107.9}, {"text": "I edited my review to get the steam autumn sale badge10/10 tho fo sure", "helpful": "969 people found this review helpful, 792 people found this review funny", "recommendation": "Recommended", "rewards": 1, "hrs_on_record": 185.3}, {"text": "Im really enjoying this game. Only bad things I have to say about it at this time is the performance. I get a ton of frame rate loss.", "helpful": "146 people found this review helpful, 6 people found this review funny", "recommendation": "Recommended", "rewards": 0, "hrs_on_record": 40.0}, {"text": "Update 2021 July 14:The game has improved a lot over the past year. Most notably (for me, at least):* Much quicker load times, especially between different scenes;* Better FPS and FPS stability;* Significantly reduced bugs;* The addition of a few \"fetch\" or \"go there, kill that\" quests.However, the game still lacks a lot of substance. Once you get into the mid game, your gameplay goes into a cycle of:War -> Go pick-off enemy lords one by one, make money from selling loot and ransoming there; Or assemble an army and go siege a town;Peace -> Ride around looking for war horses and levelling your troops.Rinse and repeat.Siege AI is still INCREDIBLY stupid. I can't emphasize this enough, it's just non-existent, really. If you're trying to join a siege with other lords, they will just send their troops to scale the walls, then RECALL them, and then just leave them to stand in the middle of the field, getting blasted by mangonels. So much potential fun with sieges, but completely wasted on absolutely retarded (non-existent) AI.I'm really hoping the gameplay will be expanded further down the line. Original review below.__________To quote the devs: \"We don’t believe in releasing a game before it is ready just because we might miss the hype\". Oh, the irony... Some bullet-points:  *   There is very little to do in the game. Apart from the basic \"acquire troops, train them, fight, go acquire more troops, repeat\", there's not much else left of substance.  *   The skill tree / perks are broken or just plain not implemented;  *   Quests are absolute rubbish. Here's a taster: deliver cattle from this town to the next; follow a caravan around, go to the next village and talk to an NPC. Zero creativity went into making these quests;  *   Companions are dull and uninspiring, there's very little you can do with them. Some things you CAN use them for are: 1) as an extra soldier; 2) as a party leader. The latter one is pretty cool, you can set them up to basically become like the other lord NPCs, meaning the companion will wander around the map, gather and train troops, engage bandits and enemy factions. Unfortunately, they will be captured, sooner rather than later. Then you, a lord of 2 cities and 3 castles, will have to journey across the land just to fetch the failed party leader from a bl**dy tavern; You can also set them up to lead caravans, which have the potential to make you extra money, but that's it. They get captured too easily that way, and you lose the initial investment you paid to set up the caravan.  *   Sieges play out like a game with the bots set on the lowest difficulty. The AI clearly struggles with path-finding, and has very rudimentary \"assault\" AI. Basically, they will get stuck on ladders, at the bottoms of ladders, in front of the gate, on top of the ladder. Although I do expect this will be sorted out;  *   There's close to zero interaction options with other NPCs - you can play some minigames with them (board games), ask them about a previous war (they'll give a short story about it, nothing too interesting), ask them about the current situation (they will give a very generic reply) or try to barter with them. With a few exceptions, that's pretty much it;  *   There's close to zero diplomacy, apart from wars/peace. If you do make peace with a faction, that faction will likely declare war on you a few days later;There is a \"feudal council\" system, where lords in a faction can vote to pass certain laws, which is a cool feature and does seem to work relatively well.  *   So many broken mechanics I can't be bothered to list them all... But perhaps my worst experience (in terms of gameplay) was in relation to enemy AI lords fixated on raiding my villages. The situation was one where at the start of the war, an enemy lord started looting one of my villages. I quickly defeated and imprisoned this lord, only to see 2 more enemy parties coming to raid the same village. I made little work of them, as well, capturing the lords. Not a day has passed, and I defeated a couple of more lords, at which point the first lord has escaped. A couple of days go by, I now have maybe 8 lords as prisoners in my party and what do I see..? The first lord whom I defeated is back with a new army. The other captured lords also eventually escape (regardless of whether I hold them in my party or put them in a dungeon), and I end up in an endless cycle of defeating, capturing lords, them escaping and returning with new armies. Ridiculously frustrating.Overall, I just cannot express enough, the utter disappointment I have with the game. I do not see where the developer time went, allegedly the game was in development for MANY years. I remember seeing playable demos back in, what, 2017? The game was announced way back in 2012. Now we're in 2020, and they decided to go for the money grab (I refer your to the quote from the devs at the top of the review) and release the game as \"\"Early Access\"\". To be fair, at first it seemed quite alright. In the first half of April 2020, we were getting pretty substantial updates every day, ironing out bugs and adding small bits to the game. But then they decided to switch to a \"larger weekly\" update schedule. As of writing this review (May 31st), we've had exactly 4 larger \"weekly\" updates, with the latest being dated May 15th. This week the update included fixes for 4 or 5 instances of game crashes, basically a micro-patch. At these rates, I am no longer hopeful to see a \"\"Full release\"\"\" of the game. In summary: The game in its current state just feels empty, lifeless. Contrary to what others have noted, there is actually very little to do. The grind feels alright at the beginning, when you're building your skills and acquiring equipment and troops, but it gets old really fast. You can, as I did, start the game from zero at that point, but really, after your 5th restart you can't be bothered anymore.The game is on sale at full retail price, and is available to anyone. At this point hiding behind the \"\"Early Access\"\" designation is just cynical, in my opinion.My recommendation: do not buy the game, it's not worth it in its current state. Wait for the game to be \"\"Officially\"\" released, and read the reviews then.", "helpful": "1,403 people found this review helpful, 56 people found this review funny", "recommendation": "Not Recommended", "rewards": 84, "hrs_on_record": 191.3}, {"text": "Should you try Mount & Blade 2: Bannerlord? It's a big maybe. \"Hang on a second, dude. You have 160 hours on the clock!\" you might say but that was actually just to try something and it's the whole reason why it is a maybe. 160 hours of gameplay for a 50€ title is definitely okay but this title is falling short in a LOT of areas and I don't think the finished game will be able to change that.Let me explain:I tried to capture the entire world map which I honestly can only recommend if you want to see what this game is NOT good at:- getting clans onboard: this is luckbased and you can ONLY persuade existing clans to switch sides, with a good chunk of luck and A LOT of gold involved. 2-5 million to switch to you is no rare sight. Even when you are ruling the vastly bigger kingdom, no one will ever voluntarily switch over. If you crushed one kingdom, the clans will simply move over to different kingdoms - but never ever your own. - managing your clans: simply not possible. They do what they want are are mostly incompetent. Breaking off sieges in the middle, not trying to protect villages and forming armies on one side of the map, trying to get all the way over to the other side which does not work because the army will run out of cohesion. - marriage and inheritance: gives you virtually nothing as far as I could tell. There is simply no system whatsoever that would give you any rights to titles or anything. In fact, something as rights and titles isn't even in the game. It's just an attribute the game selects for the ruling dude and if he dies it randomly hops over to someone else, in many cases even from a different clan. - battles: great fun and all in the first few rounds with smaller armies of like 50 vs. 50. Once you go into the 300's (both sides combined) you will find many battlefields are simply too small. The enemy AI is also mostly trying to avoid fighting by going hard left or right from their spawn position where you have to lure them out. Since there can only be 400 soldiers on the battlefield at any given point enemies will simply spawn in as you are defeating them, especially in battles against larger armies. So you and your men made it to the enemies (that just waited near their spawn point), you overwhelm them just to get more enemies spawned right in the middle of your troops, causing huge casualties. This is just a really bad system, especially if have to fight \"wave after wave\" of these spawns. Tiresome and NOT fun. - battle simulations: basically random results. Even if you have 150 men vs. 26 looters chances are they kill one of yours, especially very high level units like Battarian Heroes or Elite Cataphracts. This just does not make sense. If you play the battle personally they are not even getting near your units before bailing and yet in a simulation they kill one of the best units. The simulation also does not scale. If you have very large armies (600+) against similar sized armies, you suddenly get away with just 8 casualties. If you try a 200 vs. 200 the results look quite different. Its just very unpredictable and intransparent. I always avoided simulations for the majority of fights to avoid loosing good units. - sieges: it really is funny that the video on this shop page from 2016 shows a lot more features than are actually functioning in the game. Sieges are boring and messy. If you use ladders, siege towers or you breached the enemy walls does not matter much in most cases. You will still have to run up against a shield wall that you can easily run around and slaughter the enemy from behind. There are no really strategic options that would make it interesting or challenging. The only challenge you can have is going up against 400 men with just 50. Also, the enemies spawn directly in the courtyard in front of the gate, which is great if that is where your men are currently fighting. The spawning is just daft. - wars: essentially the other kingdoms will constantly spam you with war declarations. As there is no grants, titles or rights implemented in this game, there is no visible reason as to why this happens. At some point you are at war with basically everyone further exposing the completely incompetent own clan AI. Since villages create an endless supply of soldiers, those wars never end and you end up fighting an army against the very same guys you just had let go after a fight over and over and over again. Such fun!- own parties: As the leader of your clan you can create parties that you can also call to your army at any time for free.Sadly those parties are constantly being wiped out and do NOT recreate themselves. It has to be done manually while the enemy AI immediately sends out beaten heroes again to recruit from the endless peasant supply and go to battle again. - trading: Yes, possible but you cannot achieve anything with it, aside from getting rich. You cannot buy titles or castles or land or anything, since such system are simply not implemented and not even hinted at.You can create Caravans but much like your own parties, they constantly get wiped out and not replaced. It's just another hassle to deal with for very little benefit. - crime: every city has a crime lord or two but in the end they are completely meaningless. Being on the bad side of the law is meaningless too. Even when you are on the good side you are constantly in wars with everyone so the reason why you fight comes down to your own roleplaying if you are into that sort of thing. Being an outlaw has no benefits, special mechanics or anything. Just everyone hates you but that will happen eventually anyway.economy: since the wars are neverending in this game, the economy suffers greatly. The AI will just go from city to city and buy all the food that is there, completely stripping it empty. Stationed garrisons will then desert since there is no food for them left. Its just a completely unmoderated system, much like the endless peasants. So, all in all I hope this gave you an insight. The TL;DR of this is: this game would need at least 5 years of early access to put all the required systems in place to make this a diverse playing experience. The novelty of playing those battles wears of quite quickly and there really is not much else in this game. Any kind of systems to manage your clan or kingdom, the economy, diplomacy.. it's all not existing. The mod-community is trying to help out and they have created fantastic mods but it shouldn't be their job to fill those huge gaps. This game has been out for an entire year now but is missing SO much. I don't have any hopes of the things I described ever to become a reality since their predecessors were not particulary good at those either AND none of what is missing is even really hinted at. If there is a roadmap, it's a Star Citizen-like one. No thanks.", "helpful": "645 people found this review helpful, 22 people found this review funny", "recommendation": "Not Recommended", "rewards": 79, "hrs_on_record": 160.2}, {"text": "Why the pretty lady not want to marry me???", "helpful": "93 people found this review helpful, 85 people found this review funny", "recommendation": "Recommended", "rewards": 12, "hrs_on_record": 69.9}, {"text": "Highly recommend if you like strat + medieval combat.  Single Player - super fun, just like the old mount&blade but better graphics.  Updates come all the time, lots of mods, can't wait for the LOTR one to be finished. lots and lots of potential to an already great baseMutliplayer - offers some pvp but the real gem is Captains Mode.  It is a 6v6, each side is assigned a faction.  You get to control a entire unit of troops from that faction (as does everyone else).  SO MUCH FUN!!! Especially when you slay.Overall: A.  It is still in pre-release so expect a bug or two but it is def playable.  Have recommended to all of my friends", "helpful": "88 people found this review helpful, 1 person found this review funny", "recommendation": "Recommended", "rewards": 5, "hrs_on_record": 1.0}, {"text": "This game is the perfect follow-up for anyone who loved Warband or the original Mount & Blade. It's still in early access, but I think if you, like me, have borderline exhausted Warband, this is the next step. Although, it is a lot more complicated than its predecessors, and the game does introduce you to its new systems fairly well, there are some things you should be made aware of before you start.1) The entire game revolves around a clan mechanic. No longer are you a starting adventurer with nothing and no one, now you have a clan. You rise and fall with your clan. When you die (yes, you can die), you take over as someone else from your clan. There is now an actual reason for getting married, but the clan system can take away some of the fun of Warband where it was just you. Starting the game, you have several siblings whose lives you are in charge of, and because of this, it can feel micromanagy at times. Clan tiers are a thing, and the game locks you out of some of the more fun aspects of Warband (like starting your own kingdom), until you hit a certain clan tier. So just bear with it.2) The whole trade system is weird. In Warband, to become a merchant, you just had to buy and sell goods and open an enterprise. Here, you can make caravans for yourself and buy multiple workshops. Right now, they're pretty nerfed, so check out the mod community.3) Kingdom management is a lot more complicated. Whether you are a vassal or a monarch, there's a lot going on, so don't feel bad for looking things up or pausing the game just to read through the kingdom screen (press K). This isn't Crusader Kings, but it can still be overwhelming.4) Mods work with native. Unlike in Warband, for the most part, mods here affect your native gameplay, and some work with new updates and some don't. I recommend playing the game for about thirty hours without mods, then adding a few in. But like any Elder Scrolls veteran can tell you, try adding one at a time in case it starts crashing your game.5) Years pass quickly. I've had Warband playthroughs where I conquer Calradia in about a year and a half. Here, it's much different. Years pass quick, and you'll still probably be doing the first two missions by the end of year two on your first playthrough.6) There is a story (kind of). Like Skyrim, the game locks you out of the fun stuff until you do the early story quests, and one of them can be a nightmare. Feel free to look up guides, because at this point, most of the mods to help you with it do not work with the current update (written October 26, 2021). There is a point to the story, it explains why the world is the way it is, but I don't blame you for just doing sandbox after your third or fourth start.7) The game is early access. Things change all the time. Things are buffed and nerfed like no other. Don't be discouraged. The modding community is great, and there are a ton of things to help. Right now, workshops are dead in the water, but there are mods to make them not be a bane when they should be a boon. Please don't feel weird or bad for using cheats after you have to restart because an update killed your perfect playthrough, or you're using an OP mod because you're last character was almost king of all Calradia, but now because you're a Sturgian, you're getting culture penalties everywhere. Just don't sweat it.Overall, this is one of the most fun games I've ever played, and it is a true sequel to the original games. If you think you can live with the early access \"features\" pick it up. If not, just wait. And if you've never played a Mount & Blade game before, I would recommend either starting here or Warband. Warband might be a more consistent experience, but if it doesn't hook you, pick this game up on the cheap.", "helpful": "55 people found this review helpful, 3 people found this review funny", "recommendation": "Recommended", "rewards": 1, "hrs_on_record": 171.1}, {"text": "Chart For Bannerlord---{Gameplay}---🔳Try not to get addicted☑️Very good🔳Good🔳Nothing special🔳Ehh🔳Bad🔳Just dont---{Graphics}---🔳Masterpiece☑️Beautiful🔳Good🔳Decent🔳Will do🔳Bad🔳Awful🔳Paint.exe---{Audio}---🔳Eargasm🔳Very good🔳Good☑️Decent🔳Not too bad🔳Bad🔳Earrape---{Audience}---🔳Kids🔳Teens☑️Adults🔳Everyone---{PC Requirements}---🔳Check if you can run paint🔳Potato🔳Decent☑️Fast🔳Rich boi🔳Ask NASA if they have a spare computer---{Story}---🔳Doesn't have🔳Something isnt nothing I guess☑️Not greatly told🔳Average🔳Good🔳Lovely🔳Will make you cry or smile alot---{Playstyle}---☑️Almost never the same in any two people🔳varies a little bit from person to person🔳Weapon AND character classes🔳Weapon OR character classes🔳Creative AND Survival🔳Creative OR Survival🔳Melee AND Ranged🔳Melee OR Ranged---{Difficulity}---🔳Just press a bunch of buttons🔳Easy🔳Significant brain usage☑️Easy to learn / Hard to master🔳Not so easy🔳Difficult🔳Dark Souls---{Grind}---🔳Nothing🔳Only if you care about leaderboards/ranks🔳Isnt necessary to progress☑️A bit grindy sometimes🔳Average grind level🔳A bit grindy🔳Insanity---{Game Time}---🔳Long enough for a cup of tea🔳Short🔳Average🔳Long☑️Depends on you🔳Endless---{Price}---🔳Just buy it🔳Worth the price☑️Wait for sale🔳Maybe if you have some spare money left🔳Not recommended🔳Dont throw money into a rubbish bin---{Micro-Transactions}---🔳EA🔳Mobile Game(Necessary if you don’t want to wait 15 weeks to construct a toaster)🔳”Premium” Currency AND Normal Currency🔳”Premium” Currency OR Normal Currency🔳Quick way to advance🔳Fortnite(Skins/Emotes/Etc)🔳Only to show off big time🔳Level DLC☑️None---{Bugs/Glitches}---🔳Never had any🔳Minor bugs/glitches☑️Few bugs/glitches🔳Can get annoying🔳Ruining the game🔳The game itself is a big terrarium for bugs/glitches", "helpful": "709 people found this review helpful, 94 people found this review funny", "recommendation": "Recommended", "rewards": 141, "hrs_on_record": 53.2}, {"text": "I have over 1000 hours in Warband. This is EA and i have over 400 hours in already. Are there bugs? Yes. Does it have issues? Yes. However it's still a great game despite these issues. It's the best \"medieval warlord simulator\" out there. I have gone for months at a time not playing this, then I come back and put another 100 hours in. Games great. And with more time and polish it'll be amazing. And you know the Mods are gonna be amazing.", "helpful": "67 people found this review helpful, 2 people found this review funny", "recommendation": "Recommended", "rewards": 4, "hrs_on_record": 532.1}]}]